{"restaurants": [{"g49463-d3471247": {"data": {"foursquare": {"count": "216", "rating": "9.5", "reviews": [{"review": "If your waiter introduces himself as \"Harry\", thank your luck stars. He has complete knowledge of the menu and made the perfect recommendation, Crispy Pork Belly Soup. Simply outstanding.", "scale": ""}, {"review": "Everything is delicious but the pork belly soup...mannn", "scale": ""}, {"review": "Amazing alternately deep, warm spices, and refreshing bright flavors. Great curries, cocktails, atmosphere.", "scale": ""}, {"review": "Go Lao hot at your own risk.", "scale": ""}, {"review": "Great vibe, succulent soft shell crab &amp; great pad Thai.", "scale": ""}], "url": "https://foursquare.com/v/bida-manda-laotian-restaurant-and-bar/4ee404309911944900b07ad5"}, "tripadvisor": {"count": "408", "rating": "4.5", "reviews": [{"review": "No need to add to the other reviews here. How much praise can anyone heap on a place? Reviews say it all. First time visit with high expectations. Had lunch. World-class food beautifully plated and presented. Will be back as a priority next time we are in town.", "scale": "4"}, {"review": "This Place Exceeded Expectations. Ambience Is Great, Service Is Excellent & The Food Is Awesome. Highly Recommended.", "scale": "5"}, {"review": "Wow. Excellent. Went there for a late Valentines because this was the earliest weekend I could get a reservation. Service was awesome. You can tell hostess and wait staff actually communicate.\nI got papaya salad with filet mignon. I promise I'm not trying to sound stuck up but I love a good steak and have been to every \"steakhouse\" in...", "scale": "5"}, {"review": "The pork belly soup is certainly the best soup I've ever tasted and is among the best dishes I've had in my life. The mix of flavors is terrific and I often get it to go. The fresh herbs and veggies really make it spectacular.... This is basically a review of one dish, but trust me.....get it and you won't...", "scale": "5"}, {"review": "I went here with a large group of friends. We had to make reservations a week in advance for such a large party, even though we went on a Tuesday evening. The ambiance of the restaurant is very nice, the menu is fascinating, and the drinks are absolutely amazing! I got their Duck Larb, the traditional way. It was good...", "scale": "4"}], "url": "http://www.tripadvisor.com/Restaurant_Review-g49463-d3471247-Reviews-Bida_Manda-Raleigh_North_Carolina.html"}, "yelp": {"count": "621", "rating": "4.5", "reviews": [{"review": "I've been wanting to come here for a while. My work colleague is originally from Laos and highly recommended Bida Manda. So taking a day off this last Friday I took my wife for an early lunch.", "scale": "5.0"}, {"review": "After reading all the great reviews on Yelp and being an avid Thai food eater, I really want to try this place. We were told the wait would be around 45 minutes on a Tuesday night for table of three, but we were able to get to our table with in 15 minutes so even though we are willing to wait that long, we were happy to be seated sooner than that.", "scale": "4.0"}, {"review": "Bida Manda made this small quaint restaurant look fancy and elegant. With its bamboo/stick walls and its simple but elegant tables decorations.", "scale": "5.0"}, {"review": "When I was in Raleigh I just knew that I HAD to come here. The reviews are insane and I would soon find out that I would be writing my own 5 star review.", "scale": "5.0"}, {"review": "Very nice modern upscale Laotian /Thai restaurant.That pampers their guest with shrimp chips to munch on as customers peruse the menu. After dinner you get a shot of the digestive of the day. Way cool.", "scale": "4.0"}], "url": "http://www.yelp.com/biz/bida-manda-raleigh"}}, "name": "Bida Manda", "photo_url": "https://irs2.4sqi.net/img/general/240x240/18794588_UDrFpuWmoAbzM9i8M4Fd-XimYBTdb1-S9I1r3msbMuk.jpg"}}, {"g49463-d444941": {"data": {"foursquare": {"count": "43", "rating": "8.4", "reviews": [{"review": "The food is good, have been a few times and have enjoyed it every time.", "scale": ""}, {"review": "You can't go wrong with anything. I love their Caesar salad with the grit croutons. I always ask for extra croutons!!", "scale": ""}, {"review": "Loved the she crab soup! Charleston-esque", "scale": ""}, {"review": "Meal was delicious from start to finish.   Fried green tomatoes and arugala salad were a great starter.  The seafood grits was outstanding but very close honorable mention to the catfish.", "scale": ""}, {"review": "The Carpet Bagger was excellent. The barnaise sauce is great! For dessert the Pumpkin Bread Pudding was amazing!", "scale": ""}], "url": "https://foursquare.com/v/glenwood-grill/4bace827f964a52012183be3"}, "tripadvisor": {"count": "168", "rating": "4.5", "reviews": [{"review": "We had a small business lunch here. The seating was very satisfactory. The service was very good. The menu is oriented to unique dishes with a southern flair. The meals were excellent. The she crab soup is quite good. The collards are best ever. The sea bass is good. Another unique dish was Caesar salad with crisp oysters.", "scale": "5"}, {"review": "Loved this spot so much we returned a second night before leaving Raleigh. Terrific food, nice staff and welcoming dcor. The pork tenderloin is not to be missed.", "scale": "5"}, {"review": "My wife and I and another couple ate at the Grill because it was recommended by a friend. We were not disappointed. The atmosphere was noisy but friendly. The service was exemplary. We all started out with she crab soup, one of my favorites. It was outstanding - rich, creamy and loaded with crab meat. I then had the stuffed...", "scale": "5"}, {"review": "Such a quaint little nice restaurant. A gem in a small strip center that will not disappoint. I started with the fried green tomatoes with the pimento cheese and they were excellent. For entree I had the pork tenderloin and it was soooooo good, fork tender and with the Brussels sprouts and cauliflower pure that lend just a slight woody...", "scale": "5"}, {"review": "The dinning experience at the Grill gets better with each visit, Try the Short ribs or the Salmon. My father is a fan of the catfish with a side of grits. He knows catfish!!!\nChad at the bar is a treasure. You never leave a stranger.", "scale": "5"}], "url": "http://www.tripadvisor.com/Restaurant_Review-g49463-d444941-Reviews-Glenwood_Grill-Raleigh_North_Carolina.html"}, "yelp": {"count": "173", "rating": "4.5", "reviews": [{"review": "The only 5 star establishment I dined at in the triangle.", "scale": "5.0"}, {"review": "We made reservations for Glenwood Grill for Valentine's Day and we left very satisfied with our experience. I would definitely recommend Glenwood Grill for a romantic date night. It is a smaller restaurant, which makes it feel cozier. However, depending on where your table is, you could end up being pretty close to your neighbors. This doesn't really bother me too much, but I could see that some other people might get bothered. But for Valentine's Day, I think they planned their reservations to leave plenty of time between seatings. Despite, the tables being close together, it never felt too crowded or loud.", "scale": "4.0"}, {"review": "We went to Glenwood Grill for Valentines Day and the food and service were just fantastic. The food was contemporary American, and everything was cooked amazingly well. We started with the oyster Rockefeller dip, and it came with four succulent, fried oysters over a creamy and cheesy spinach dipped served with flat bread. The fried oysters were huge, juicy, and flash fried perfectly without drying them out. The spinach dip was super creamy and cheesy. Definitely not healthy, but tasted amazing with the flat bread.", "scale": "4.0"}, {"review": "\"Delicious gourmet food & preparation in a Glenwood Ave. strip mall\"", "scale": "5.0"}, {"review": "The Glenwood Grill. Wonderful place. I moved into my new home a few miles North off of Glenwood and would sometimes shop at the Harris Teeter that is in the same strip mall plaza. I used to see the Glenwood Grill and thought that I would eventually go by to see the fare. Great food. Good ambiance. Small intimate feel to the restaurant. Romantic. I cannot wait to get a girlfriend or a significant other to bring here. Which goes to my first point of why this place is so great...", "scale": "5.0"}], "url": "http://www.yelp.com/biz/glenwood-grill-raleigh"}}, "name": "Glenwood Grill", "photo_url": "https://irs1.4sqi.net/img/general/240x240/37836002_H_SF2SsO4AMzY9hhnsBqZP6p-4sSezf3MGDJB3OPLwQ.jpg"}}, {"g49463-d4112217": {"data": {"foursquare": {"count": "455", "rating": "8.8", "reviews": [{"review": "I had sushi but 3 friends raved about the burgers!", "scale": ""}, {"review": "Bento boxes are the best, gives you the best of both worlds.", "scale": ""}, {"review": "Bento box is great way to have sushi and burger. You can customize EVERYTHING, which is not the of the Orlando Cowfish.", "scale": ""}, {"review": "Expensive but good. Interesting food fusion between burger and sushi.", "scale": ""}, {"review": "Excellent food, and while the wait can be a bit longer than expected its worthwhile. Only one remark for the sashimi slices...2 big!!!", "scale": ""}], "url": "https://foursquare.com/v/the-cowfish-sushi-burger-bar/512fae5be4b01e7458f3057a"}, "tripadvisor": {"count": "293", "rating": "4.5", "reviews": [{"review": "My husband and I went the other day. Luckily for us it was an off hour so we were seated immediately and the place was almost empty. Our waiter was very attentive and helpful...showing us the menu as we have never been there before. I took the waiter's suggestion and got the burger with the short ribs on it. Yum!!...", "scale": "4"}, {"review": "I've been here twice and both times the service and the food was divine! Portions are very large. Be prepared to take a doggy bag. They have a lamb burger that is delicious. There is a bar area and a large fish tank with beautiful fish swimming around. Wait staff are well trained and present themselves professionally.", "scale": "5"}, {"review": "The food was top notch, the ambiance was inviting, our waiter was super friendly, and the food did not take too long. It was cooked beautifully, it had the right texture, and it should be in the top 10 on Trip Advisor.", "scale": "5"}, {"review": "Haven't been her recently so posting an updated review\nLocation is interesting, in the residential part of North Hills. The Resturant decor is interesting, aligning with the burgers and sushi.\nMenu is salads, burgers, and sushi. I had custom burger and sweet potatoes fries and it was very good.\nMy only negative is that it's rather expensive, $17 for burger,...", "scale": "4"}, {"review": "I had a couple of teenagers with me who are both picky eaters we enjoyed the restaurant and had fun with the presentations of the food!", "scale": "4"}], "url": "http://www.tripadvisor.com/Restaurant_Review-g49463-d4112217-Reviews-The_Cowfish_Sushi_Burger_Bar-Raleigh_North_Carolina.html"}, "yelp": {"count": "587", "rating": "4.5", "reviews": [{"review": "The mysterious cowfish was always ridiculously packed with people so I've stayed away until last night. Arrives around 630. As expected its packed. Wifey, who does not like to wait gives me the negative Nancy again after letting me choose tknights restaurant.", "scale": "5.0"}, {"review": "I'll admit it : I was skeptical. A place that can do both sushi and burgers well? Sushi in North Carolina? The Cowfish can deliver!", "scale": "5.0"}, {"review": "Fresh, Fabulous and Fun.", "scale": "5.0"}, {"review": "This place is so much fun, great sushi bar but also a great burger bar for those who may not partake of aforementioned raw fish (am looking at you Mindy M.). Great and knowledgeable service, too", "scale": "5.0"}, {"review": "I was sceptical about going here @ 1st , my wife wanted to take me on a date (Thursday Night) I was like WOOOW , PPl go out on a thursday night This place is \"PACKED\" and we had a 45 min wait , although it only took like 20 mins and the Food is amazing , Burgers & Sushi - Who Knew ???? But overall the atmosphere is very lively & energetic , try this place out !!!!!!!", "scale": "5.0"}], "url": "http://www.yelp.com/biz/the-cowfish-sushi-burger-bar-raleigh"}}, "name": "The Cowfish Sushi Burger Bar", "photo_url": "https://irs1.4sqi.net/img/general/240x240/9337_q_3J4kzZyyjx-RrYKHxHpPeUbGEjG-Jgopp5YQ1zjmk.jpg"}}, {"g49463-d6407240": {"data": {"foursquare": {"count": "18", "rating": "8.6", "reviews": [{"review": "Great food and the service is good too!", "scale": ""}, {"review": "This is the best Chinese restaurant in the area. Love the food here.", "scale": ""}, {"review": "The lunch special combo is a great deal! An entree, rice/noodles, and an egg roll for $6.25. Make sure to try their sesame chicken!", "scale": ""}, {"review": "Green curry is awesome. String bean chicken extra spicy off the lunch specials.", "scale": ""}, {"review": "Excellent Thai and Chinese. Best in Raleigh", "scale": ""}], "url": "https://foursquare.com/v/red-pepper-asian/531cde03498ecda932de475c"}, "tripadvisor": {"count": "23", "rating": "4.5", "reviews": [{"review": "Small and quaint with consistently great food on each visit. Great for lunch, dinner or take out. Much needed in the area.", "scale": "5"}, {"review": "We went to Red Pepper Asian based of the reviews. The food was great and everyone was very friendly. I will definitely be back. They have the freshest tasting egg rolls I've every had.", "scale": "4"}, {"review": "The Red Pepper is the Fortune Palace reborn. The Red Pepper is smaller than the Fortune Palace, but the owner and staff are very accommodating. Those that call the Red Pepper an\"American\" version of Chinese food don't know how to order. I entertained people from China at the Fortune Palace, they didn't want to go anywhere else.", "scale": "5"}, {"review": "If you ever tried the Fortune Palace on Capital and you liked it, then you'll love this place. Fortune palace owners sold their business a few years ago and recently just opened this much smaller version. Menu is smaller, not as much selection but still very good. The Calamari is very popular because they use Cuttlefish instead of regular Squid....", "scale": "5"}, {"review": "Thank god I had google maps to get me there, otherwise I would not have found it. When I got there, the parking lot was empty but it quickly filled up. The food was standard american versions of Chinese food, which was tasty and satisfactory, but I will probably try to find another Chinese restaurant with more imagination.", "scale": "3"}], "url": "http://www.tripadvisor.com/Restaurant_Review-g49463-d6407240-Reviews-Red_Pepper_Asian-Raleigh_North_Carolina.html"}, "yelp": {"count": "69", "rating": "4.5", "reviews": [{"review": "This little gem is definitely tucked away. You can't see it from the main street or any street really and the only way I even found out about it was from other reviewers.", "scale": "5.0"}, {"review": "Tucked away in an area far far away...in Raleigh. This is a hidden gem on New Bern Avenue in a quite shopping area. The inside is well decorated and clean. The menu is unique with just the perfect number of items to choose from.", "scale": "4.0"}, {"review": "I've been to Red Pepper about 10 times and have never been disappointed with the quality of the food or the service. Both are top-rate.", "scale": "5.0"}, {"review": "A really good Chinese restaurant in East Raleigh Considering that much of this area is filled with walmarts, chain restaurants and general sketchiness, I was shocked to find this place. Don't be deterred by the strip mall location-it's actually really cute inside and the food is awesome.", "scale": "4.0"}, {"review": "Sunday night and Husband actually uttered the words that he was hankering for Asian (not a common occurrence)...so I went with it, fast! Searched \"best Asian\" here and was drawn right into reviews and pics from this place. Off we went, unsure of where exactly. Let me clarify:", "scale": "4.0"}], "url": "http://www.yelp.com/biz/red-pepper-asian-raleigh"}}, "name": "Red Pepper Asian", "photo_url": "https://irs2.4sqi.net/img/general/240x240/139392214_SP4HHMse8ltF1FYORTveycXhF6aJjS0MI3FKR_WlzSg.jpg"}}, {"g49463-d6610534": {"data": {"foursquare": {"count": "76", "rating": "9.0", "reviews": [{"review": "Wonderful crab cakes and pizza!!", "scale": ""}, {"review": "Pizza. Salad. Sandwiches. You really can't go wrong here.", "scale": ""}, {"review": "Savory food. Beware of cross contamination, they are not careful. I have dairy and nut allergies and left with an inflamed face after the meal.", "scale": ""}, {"review": "The bartenders are mixing some great cocktails like \"Saving Grace\" and \"The Last Word\".  Crunchy potato &amp; arugula salad is my favorite on the menu.  Can't wait to come back and try the pizzas.", "scale": ""}, {"review": "Brick oven broccoli, cast iron goat cheese (ask for extra bread), spicy sausage &amp; black pepper honey pizza finish with chocolate budino.... amazing", "scale": ""}], "url": "https://foursquare.com/v/tazza-kitchen-cameron-village/528a6b0e11d27a62a2728622"}, "tripadvisor": {"count": "62", "rating": "4.5", "reviews": [{"review": "I'm going to be honest, I'm a pain in the butt when it comes to restaurants. I'm rarely every happy or enthusiastic but our meal here was one of the best ones we have had all year. As a chain, it pains me to be so enthusiastic but literally every dish that every one of us got was great! Service...", "scale": "5"}, {"review": "This is a good casual dining restaurant. They have a short menu selection. We each had the wood fired pizzas. Each was good. The sausage, cheese and honey was really good. They have a nice craft beer menu. The wine menu is limited but is has Murillo choices at a fair price. The decor is very open; a bit noisy...", "scale": "4"}, {"review": "Food was really good - especially the melted goat cheese in a skillet. Service was average, but in fairness the restaurant was packed. Not a great place to have conversation - super noisy - but if you like to be in the middle of everything, then it's a great choice!", "scale": "4"}, {"review": "Tazza Kitchen occupies the old Cafe Cartura that used to be in Cameron Village. There are some interesting similarities but doesn't really hold a flame to it. A friendly waitress pours you some bottled water just like the old place. Gone are the glorious meat and cheese plates, sandwiches, and vast kaleidoscope of menu items. Here the menu is very...", "scale": "2"}, {"review": "The food was fantastic. The Brussels Sprorts were so good. We have been there several times. Love the food atmosphere Everything. Can't wait to go back", "scale": "5"}], "url": "http://www.tripadvisor.com/Restaurant_Review-g49463-d6610534-Reviews-Tazza_Kitchen_Cameron_Village-Raleigh_North_Carolina.html"}, "yelp": {"count": "166", "rating": "4.5", "reviews": [{"review": "Spectacular dinner everything we ordered was super delicious ... We must comeback pizza", "scale": "5.0"}, {"review": "This is one of my absolute favorite restaurants, and I will always return. With that said, I had a really bad experience on my birthday this past November, and I'm not sure it was handled in the best manner.", "scale": "4.0"}, {"review": "Ended up here before a night out. Likely just reiterating what's already been said countless times but the sprouts held their own as an app, polenta was phenomenal and the pizza the lady got had a pretty admirable amount of flavors going on too.", "scale": "5.0"}, {"review": "I FINALLY got to try the Spicy Sausage and Black Pepper Honey pizza that everyone has been raving about! If other restaurants are smart, they'll start having honey as a toppings option also. The contrast between the spicy sausage and the black pepper with the sweet honey worked amazingly. Another thing that I really like about Tazza's pizzas is that they have very thin crusts. It makes the pizza not too filling and I don't feel like I'm in a food coma when I finish, unlike my experiences at most pizza places. I wouldn't recommend these pizzas for sharing, unless you are ordering some other items, because of this reason (And also because it is just too good to share). But another thing with them having such a thin crust, is that the weight of the toppings and cheese overpower it a bit, so the crust went somewhat limp. But it really does taste amazing.", "scale": "4.0"}, {"review": "I went based on yelp reviews, and I'm glad I did. It's low key enough not to intimidate me with it's trendyness, I showed up in jeans and felt fine. Had the guacamole which was a little over limed for my taste and plain (a dollop of Pico also basic) and served with naan style large round chips which were terribly hard, I ate it with a fork eventually. Didn't see it worth the price tag. I did have a rum and coke which was tasty, and definitely a decent pour, woo. I went with the suggestions of the spicy sausage and black pepper honey and it was tasty, no regrets. It is wood oven thin crust so if you don't like that style of pizza, don't get it you might be wondering where your sauce is (yay I can taste my toppings) and why your toppings don't go to the crust. The crust was a vehicle, nothing spectacular, but I'd do pizza here if I come back (I'm not from Raleigh). I beat the Saturday night rush, so service seemed good to me.", "scale": "4.0"}], "url": "http://www.yelp.com/biz/tazza-kitchen-cameron-village-raleigh"}}, "name": "Tazza Kitchen Cameron Village", "photo_url": "https://irs2.4sqi.net/img/general/240x240/75809039_U-ip5Sf4OEAWi-atPUmKNZ9eSSQUcBE6RowtwDti8Sw.jpg"}}, {"g49463-d8023813": {"data": {"foursquare": {"count": "65", "rating": "8.6", "reviews": [{"review": "The pork chop was amazing!!", "scale": ""}, {"review": "Wonderful restaurant. The ribeye and cheese grits are outstanding. Great staff too!", "scale": ""}, {"review": "Everything I've tried has been superb and fresh. The service is great too!", "scale": ""}, {"review": "Expensive but food tastes great", "scale": ""}, {"review": "Piri Piri Chicken entree", "scale": ""}], "url": "https://foursquare.com/v/kamado-grille/55416c15498e88d7fe167266"}, "tripadvisor": {"count": "100", "rating": "4.5", "reviews": [{"review": "They just started serving on Sunday this past weekend and I suggest to my wife that we give it a try after church. First of all when you walk in the restaurant, it has a nice airy wide open feel, I like that! Next the people, we were greeted at the door and each of the staff we talked with...", "scale": "5"}, {"review": "Went out to lunch and the food was great. The atmosphere is wonderful and staff very friendly. The shrimp and grits was scrumptious.", "scale": "5"}, {"review": "Great menu!! Will be back!! The shrimp and grits were amazing!!!! And service was great! Even got to see how it was cooked in the back!!", "scale": "5"}, {"review": "This place is a gem. We decided to give it a try after we heard good things about it and we were really happy with our decision. Staff very friendly, our waiter took his time explaining how to use the ordering system and answered all the questions we have. The decoration is beautiful you don't feel like you are on...", "scale": "5"}, {"review": "My wife and I recently visited this restaurant as part of a special evening together. We came after reading the good reviews. The grilled/smoked theme of the food served here really made us want to give it a try, and we weren't disappointed (for the most part).\nI ordered the ribs (which were amazingly tender), and my wife got the...", "scale": "4"}], "url": "http://www.tripadvisor.com/Restaurant_Review-g49463-d8023813-Reviews-Kamado_Grille-Raleigh_North_Carolina.html"}, "yelp": {"count": "135", "rating": "4.0", "reviews": [{"review": "I have been eying Kamado Grill for a while since the unappealing Lucky 32 was finally replaced near my parents house. With a restaurant advertising most of their cooking on speciality Kamado Joe Grills and a wide variety of tap beers.", "scale": "4.0"}, {"review": "3.5", "scale": "3.0"}, {"review": "I wanted to be amazed. Had seen the coming of Kamodo Grill. Finally the old Lucky 32 was going to be operational again. When friends suggested KG for dinner, I was excited. I checked KG out online. I was a little skeptical but loved the concept. The atmosphere was pleasant enough. Not over the top, simply a clean, modern design. The iPad (menu/ordering system) at the table was pointless. Presented simply as showy especially when the server simply used it as an ordering tool. The server would have been better off with their own tablet as opposed to it being on the table.", "scale": "3.0"}, {"review": "I really enjoyed this restaurant. The atmosphere and service is great. I love the idea of ordering from an Ipad and being able to customize your food. I was in the mood for a burger, so the KG burger was an easy choice...I went with a side of the smoked gouda mashed potatoes. If you like spicy, the mashed potatoes are packed with a bunch of flavor. My burger was cooked a perfert medium well, piled high with caramelized onions and pachetta. The weekends are busy here and we has a 45 minute wait, but it's definitely worth. I don't think you can go wrong with any choices from the menu.", "scale": "5.0"}, {"review": "We celebrated Valentines at Kamado Grill this evening.", "scale": "5.0"}], "url": "http://www.yelp.com/biz/kamado-grille-raleigh"}}, "name": "Kamado Grille", "photo_url": "https://irs1.4sqi.net/img/general/240x240/130581812_mJ95jZISyguC2klLsnRyiZUjwTaITW8HRbZSBxnayhg.jpg"}}, {"g49463-d828082": {"data": {"foursquare": {"count": "66", "rating": "8.9", "reviews": [{"review": "Best german food of my life. Its better than what you probably know german food to be. Throw a dart at the menu, sit back and enjoy.", "scale": ""}, {"review": "Pierogies and bratwurst. Don't overthink it.", "scale": ""}, {"review": "Any sausage is good. The pierogis are excellent.", "scale": ""}, {"review": "Today I had the mushroom and cabbage pierogies as an appetizer, then ordered their classic cheeseburger with a side of fries and a paprika mayo to dip them in. Bang on good!!", "scale": ""}, {"review": "Everything is fantastic. Try the pretzels, try the spatzle, try the pierogi, the venison meatballs, dont skip the schnitzel. The desserts are out of this world, as well. I'll be returning to try more!", "scale": ""}], "url": "https://foursquare.com/v/j-betskis/4b3b8c41f964a520947525e3"}, "tripadvisor": {"count": "179", "rating": "4.5", "reviews": [{"review": "What a fantastic meal!\nIt is a mix of German and Polish food. I came here with my girlfriend. It has a great atmosphere for a date.\nWe had the kielbasa starter. It came with sauerkraut, horseradish mustard, and (of course) kielbasa. There might have been something else, but it was all delicious. The horeradish mustard didn't have an overly...", "scale": "5"}, {"review": "How have we not been here before now? We live just a few miles from J Betski's and last night was our first visit.\nWe dined with 2 good friends who also traveled with us to Bavaria last year.\nWe ordered 3 apps: the smoked trout salad, the home made pretzels with pate and the bratwurst stuffed with frois gras....", "scale": "5"}, {"review": "Fantastic appetizers you will not find anywhere else. We could have eaten a dozen of the pierogi. Two of us had the always delicious pork schnitzel with cucumber salad that is outstanding. Our son ordered the venison meatballs which were amazing. All that plus a top beer selection and can't say no to desserts.\nA truly unique restaurant you should...", "scale": "5"}, {"review": "Had not been to J Betski's in years and had kind of forgotten about it. Decided to return recently with family visiting in town and we not disappointed at all. Great service and delicious cocktails. Food was outstanding. I even went vegetarian and it was wonderful. The mushroom and cabbage pierogis were terrific. I had the vegetable and noodle dish...", "scale": "4"}, {"review": "J. Betski's, hands down, provides the best Polish/German cuisine in Raleigh. Their brats are to die for and their mushroom perogies are incredible. My partner LOVES their 'beet jammer' drink (made with house-infused beet vodka). It is a small restaurant with tables close together and it is always packed - reservations are a must!", "scale": "5"}], "url": "http://www.tripadvisor.com/Restaurant_Review-g49463-d828082-Reviews-J_Betski_s-Raleigh_North_Carolina.html"}, "yelp": {"count": "229", "rating": "4.5", "reviews": [{"review": "We've been to J Betski's a couple of times now and are definitely fans. The first time was on Valentine's Day with a pre-set menu, and the most recent time was just a random date night. Both times, the food and service have been top notch. I'm not sure I would classify J Betski's as a classy or elegant restaurant and feel like going in your jeans on a date night is perfectly fine. There were a couple of tables that were a bit more dressed up, but to be honest, the atmosphere and semi-close quarters do not warrant any type of extra fancy outfit.", "scale": "5.0"}, {"review": "I had dinner here a few weeks ago and it was overall a great experience! The service was great, the food was fantastic and the company was good too!", "scale": "4.0"}, {"review": "Very, very good. Very small inside but good food. I've been here for lunch and for dinner - I can say dinner is the best. Lunch isn't bad, just not as good as dinner and not as many options.", "scale": "4.0"}, {"review": "J. Betski's is a German and Polish and then a touch of modern fusion mixed in. You absolutely have to order the pierogi and they were the best part of the meal. They were filled with pumpkin and cheese and so good we had to order another plate for the table.", "scale": "4.0"}, {"review": "We finally visited this restaurant again to celebrate my partner's birthday. Everything we ordered was out-of-this-world amazing! We decided to try the specials today, and ended up getting pan-seared scallops and shrimp, and pork and venison meatballs with spaetzle. The meatballs were by far some of the best I have ever had in my life. My partner and I both agreed that the scallops were ridiculously good. They were so fresh and perfectly cooked! We ended our meal with the famous chocolate bacon torte, and an apple strudel and left very very full and satisfied. J Betski's never disappoints!", "scale": "5.0"}], "url": "http://www.yelp.com/biz/j-betskis-raleigh"}}, "name": "J Betski’s", "photo_url": "https://irs2.4sqi.net/img/general/240x240/v-1Ue2PfO1ILtaOe7Ql5VLn8tHu3jXdCTRsXo6rsTGM.jpg"}}, {"g49463-d2281435": {"data": {"foursquare": {"count": "421", "rating": "9.3", "reviews": [{"review": "Mac and cheese is divine", "scale": ""}, {"review": "Fried chicken, cole slaw, biscuits and a local craft beer. Can't go wrong, or ask the staff, they're super friendly and helpful.", "scale": ""}, {"review": "Obviously the fried chicken! Chicken biscuit is tops. Chicken &amp; waffle is a strong 2nd. Batter contains honey. Succulent chicken. Sides have different twists on seemingly traditional offerings.", "scale": ""}, {"review": "Chicken and waffles are out of this world", "scale": ""}, {"review": "The best chicken and waffles I've ever had. Also, their Old Fashioned cocktail was delicious.", "scale": ""}], "url": "https://foursquare.com/v/beasleys-chicken--honey/4e091acc1f6e21103396e069"}, "tripadvisor": {"count": "350", "rating": "4.0", "reviews": [{"review": "Despite the chef's fame, we have found the dining experience less than satisfactory in the past because of indifferent or even condescending staff. So it had been a couple of years since we had been to Beasleys but because we were yearning for fried chicken we recently gave it another try. What an improvement! The fried chicken is good tho...", "scale": "4"}, {"review": "My favorite time to eat at Beasley's is brunch. Divine! Be prepared to wait for your table. They are usually packed.", "scale": "5"}, {"review": "I loved the fried chicken and honey drizzle. The side dishes on the other hand were disappointing. The mac and cheese tasted like they used powered cheese and was dry.", "scale": "3"}, {"review": "Everything, absolutely everything is delicious here. Best chicken, biscuits, and beverages. One of my favorite places in Raleigh. Always jammed packed and its small, but worth it. Great waiters, good prices.\nTry it. You will love it too.", "scale": "5"}, {"review": "Very simple menu with awesome tasting food. Had the veggie plate where you choose 3 side items. I was very satisfy with the three choices of veggies, as they were cooked with care for the detail and very tasty. My husband had the Beasley salad and he loved it too.", "scale": "5"}], "url": "http://www.tripadvisor.com/Restaurant_Review-g49463-d2281435-Reviews-Beasley_s_Chicken_Honey-Raleigh_North_Carolina.html"}, "yelp": {"count": "726", "rating": "4.0", "reviews": [{"review": "Beasley's was one of the first places I ate in Raleigh when we moved here four years ago, and I think it will always be a favorite..", "scale": "5.0"}, {"review": "Beasley's Chicken and Honey is a trendy, downtown Southern-style fried chicken place. Their menu is not really diverse, and it doesn't need to be. You're going to order some very good fried chicken. It's going to be crispy and delicious with a light drizzle of honey, and you are going to love it. You might get it with a waffle, which will also be delicious. The side items rotate a bit based on the season. But regardless, you're going to love them too.", "scale": "4.0"}, {"review": "It dawned on me that I never wrote a review for this place. Which I think was my subconscious trying to not post the fact that I went here twice in a week span...after eating out for a month straight.", "scale": "5.0"}, {"review": "Fried chicken and waffles is one of weirdest, yet greatest food combinations ever made and Beasley's does it really well. The fried chicken is so crispy and the seasoning in the coating is so good. It really isn't your average fried chicken, and when drizzled with their honey syrup sauce, it's the perfect balance of sweet, salty, and savory. It's almost a must to get the combo with the waffle. The waffle is light and fluffy, and does great to contrast the crispiness of the fried chicken. Just cover everything in that honey sauce and you'll be good to go. They also do a pretty good job with their sides too. I've tried their mac n cheese, and sweet potato sides and both were delicious.The sweet potato sides go great with the honey sauce as well.", "scale": "4.0"}, {"review": "Ate at Beasley's this past Sunday. Food+ Service was okay, not much to rave about here.", "scale": "3.0"}], "url": "http://www.yelp.com/biz/beasleys-chicken-and-honey-raleigh"}}, "name": "Beasley’s Chicken & Honey", "photo_url": "https://irs2.4sqi.net/img/general/240x240/XmI8GdOQ0r3hnwYUs6LFJJoB924yhNCDg7fgbh0yhq8.jpg"}}, {"g49463-d639062": {"data": {"foursquare": {"count": "98", "rating": "8.5", "reviews": [{"review": "Nice place and the food is good but very small servings. Was still hungry!", "scale": ""}, {"review": "Impressive service", "scale": ""}, {"review": "Had the pork shank and it was to die for. Service was just on point. Food was amazing.", "scale": ""}, {"review": "This place is hit-and-miss for me, but the she-crab soup is always superb. I wish they would improve their lunch service; it takes way too long to do lunch here on a work day.", "scale": ""}, {"review": "Perfect for a special date. The absolute best salmon I've ever had the pleasure of eating. The elderberry cocktail is delightful. The potatoes and spinach were my favorite sides.", "scale": ""}], "url": "https://foursquare.com/v/18-seaboard/4ade1565f964a520fd7221e3"}, "tripadvisor": {"count": "505", "rating": "4.5", "reviews": [{"review": "If you haven't been to 18 Seaboard, you are missing out on an amazing experience! From the ambiance, to the food, wine and service was incredible! Get the swordfish, you will love every second...", "scale": "5"}, {"review": "I decided to try 18 Seaboard for dinner to see if that experience would be any better than the brunch. Unfortunately this outing was much much worse and there will not be another visit there based on this dinner.\nI ordered the filet mignon, cooked medium, a dish I order at many restaurants. I was served cold, raw steak. If...", "scale": "1"}, {"review": "We have been going to 18 Seaboard for many years and have never been disappointed. They always have a good variety of dishes at a good price. My wife has to eat gluten-free and has always had several options to choose from. I highly recommend this place.", "scale": "5"}, {"review": "Well it was Restaurant Week again and 18 Seaboard is a must on our dining for this week. This time was equally sensational. I just love sitting in their round booths. Every thing was great. The service that Jamel provided along with his recommendations made the evening a success. My wife had the Shrimp and Grits and loved it. I...", "scale": "4"}, {"review": "I have been to 18 Seaboard before for dinner and was here for a business lunch to celebrate the holidays. This is a great place to have a really nice meal. Dinner can be a bit pricey but the food and service is always excellent and the atmosphere is really nice. This is a farm to table restaurant with locally...", "scale": "4"}], "url": "http://www.tripadvisor.com/Restaurant_Review-g49463-d639062-Reviews-18_Seaboard-Raleigh_North_Carolina.html"}, "yelp": {"count": "302", "rating": "4.0", "reviews": [{"review": "My wife and I had the pleasure of visiting 18 Seaboard during the Raleigh food tour. Since we were on the tour we got to meet the executive chef, Serge. We have been on a few food tours in other cities and the chefs are always nice, but it is rare to meet one who has the enthusiasm and desire to take time to talk with his diners as much as Serge.", "scale": "5.0"}, {"review": "Restaurant week was our opportunity to dine here for the first time. Regrettably, it will be our only visit. While the reception, service attention and ambiance were exceptional, unfortunately, the food wasn't. Well, there was one service hiccup, where my glass of wine appeared in timely fashion, but the sangria did not...after asking the waitress, it seemed to have been \"skipped\" by the bartender.", "scale": "3.0"}, {"review": "This has to be one of the first in the Triangle to care about bringing us NC products and telling us what those are. Way ahead of times, really. Truly appreciate this restaurant group for that!", "scale": "4.0"}, {"review": "Really want to do 4 1/2 stars... Took my wife here during triangle Resturant week. Funny thing, everything we wanted was on the regular menu. So we skipped the specials and went for it. I got the pork shank which is their most popular item and my wife a chicken dish. Both were very pleasing. Dessert were these scrumptious chocolate bourbon truffles. YUMM! here was a treat!! I neglected to mention the brisket tacos. Bananas.... The flavor was intense but ever so pleasing. We will be back", "scale": "4.0"}, {"review": "This is quite possibly my favorite restaurant in Raleigh, because I love getting some good ol Southern comfort food! (Even if it is a little fancy.) My favorite meal is the grilled meatloaf and goat cheese potatoes.", "scale": "4.0"}], "url": "http://www.yelp.com/biz/18-seaboard-raleigh"}}, "name": "18 Seaboard", "photo_url": "https://irs1.4sqi.net/img/general/240x240/1492039_7Q6ukskebudVPec1Cx7-uYziF3CrKOm9l-7SdKTVrWQ.jpg"}}, {"g49463-d6278519": {"data": {"foursquare": {"count": "39", "rating": "8.4", "reviews": [{"review": "My fave is the Shrimp Mango Jalfrezi", "scale": ""}, {"review": "Tikka masala", "scale": ""}, {"review": "I really love this place. The food was outstanding! Not too crazy about their cocktails though.", "scale": ""}, {"review": "Vindaloo, any app, kingfisher and naan to wash it down!  Staff is friendly and knowledgeable, very attentive.", "scale": ""}, {"review": "Momos are amazing!!!", "scale": ""}], "url": "https://foursquare.com/v/kabab-and-curry/52e1bc1d498e61f7931f70ec"}, "tripadvisor": {"count": "34", "rating": "4.5", "reviews": [{"review": "The food at Kabab and Curry was delicious. The Bread Basket appetizers with three sauces was outstanding. I could happily have made a meal of it. In fact, we should probably have ordered a second basket (though there were only five of us), because we all enjoyed it so much. I can't say enough good things about the three sauces...", "scale": "4"}, {"review": "I've been here for both buffet and a la carte ordering for dinner. This is my inside-the-beltline go-to Indian place.\nThe buffet is pretty good. It's not the largest or the smallest I've been to, but it has a decent selection. There are a couple of sauces, pickled onions, salad, papadum, appetizer (usually pakora), plenty of veg and non-veg options,...", "scale": "4"}, {"review": "I hosted a small party in Kabab and Curry on Nov 5th, 2015. It was a very special day as I was married that day and Kabab and Curry allowed me to entertain my family and friends on its premises. The owner Mr Tilo is an exceptional manager and host. He especially make sure to make my experience memorable. All...", "scale": "5"}, {"review": "The food was delicious and the service was very good. Haven't had Nepali and Indian food this good since I was in India and Nepal in the 1980's. The service was really good but not hovering. Goat, lamb and chicken all great, the spice level perfect for those of us who wanted hot, and great for our fellow diner who...", "scale": "5"}, {"review": "We went to try the lunch buffet, which was delicious; plenty of fresh and hot choices. One thing I will say is that the food could have been a bit spicier, but it was still very good especially for the price! The service was impersonal and uninterested. We waited a long time to get our check. But, we werent drinking...", "scale": "4"}], "url": "http://www.tripadvisor.com/Restaurant_Review-g49463-d6278519-Reviews-Kabab_and_Curry-Raleigh_North_Carolina.html"}, "yelp": {"count": "76", "rating": "4.0", "reviews": [{"review": "I have been to this place twice, both times on a Sunday night. Once coming to Raleigh, I have been looking for an authentic Indian eatery and this hands down is my favorite thus far! The past two times I orders the vegetable Samosa's, Palak Paneer, and Garlic Naan and I have not been let down (I even have enough food left over for 3 more meals for the week)!", "scale": "5.0"}, {"review": "Food: 4", "scale": "3.0"}, {"review": "I've been here for both buffet and a la carte ordering for dinner. This is my inside-the-beltline go-to Indian place.", "scale": "4.0"}, {"review": "INDIAN BUFFET, need I say more!", "scale": "5.0"}, {"review": "The best Indian/Nepalese restaurant I've tried, and as testament to this it's always packed, especially around lunch. Every thing on their menu is delicious and can be made as spicy or as mild as you want it. I've tried around half the items on their menu. The buffet selection is great and very reasonably priced for the quality of the food. The servers are very nice, but there is a bit of a language barrier depending on who your waiter is. This place has the best naan and rice pudding too. They can also make off-menu items.", "scale": "5.0"}], "url": "http://www.yelp.com/biz/kabab-and-curry-raleigh"}}, "name": "Kabab and Curry", "photo_url": "https://irs1.4sqi.net/img/general/240x240/3361890_Seykq8plVWMyzRlPzzFwQrqU59Mr7OkVYR-cidAOzdA.jpg"}}]}