{"restaurants": [{"g49463-d3471247": {"data": {"foursquare": {"count": "220", "rating": "9.5", "reviews": [{"review": "If your waiter introduces himself as \"Harry\", thank your luck stars. He has complete knowledge of the menu and made the perfect recommendation, Crispy Pork Belly Soup. Simply outstanding.", "scale": ""}, {"review": "The saffron crepe with shrimp &amp; bacon is outstanding! This place gets 5 stars in every category from service to atmosphere to the quality &amp; taste of the food. Don't forget to try dessert!", "scale": ""}, {"review": "Everything is great here. Wait can be long but just eat at the bar, they have the full menu anyway and you'll get drink service faster. The curry is delicious and so is the catfish. Get the Thai toddy", "scale": ""}, {"review": "Downtowner Magazine recommended nom nom at Bida Manda: Amphone's Curry Chicken (Van's mom's recipe), Crispy Pork Belly Soup, Saffron Crepe, Fried Bananas, Mango ice cream.", "scale": ""}, {"review": "Spring rolls, tuna ceviche for apps; pork belly soup will change your world, and don't leave w/out tempura bananas - even if you think you don't like dessert. But really, it's all delicious.", "scale": ""}], "negativeReviews": [], "url": "https://foursquare.com/v/bida-manda-laotian-restaurant-and-bar/4ee404309911944900b07ad5"}, "tripadvisor": {"count": "435", "rating": "4.5", "reviews": [{"review": "This is one of the best restaurants in Raleigh - traditional dishes reinterpreted with creativity - the result is excellent. The service is very careful; the list of beverages is - not surprisingly - somehow limited. Overall, a highly recommended restaurant!", "scale": "4"}, {"review": "A bit of background, I'm from the northeast and used to great Asian restaurants. This place was a fantastic surprise!! Honestly, to start Casey Hester was our waiter and did a fantastic job. A bit awkward, but passionate about his role. He understood the menu and was spot on.\nIf you like coconut curry, the crispy pork belly soup is...", "scale": "5"}, {"review": "We tried to go in earlier than our reservations and they were not able to seat us, so keep that in mind and if you dont live in Raleigh, you may not feel very comfortable walking around the deserted park in front of it with homeless people. Best to stay at the bar or go next door to the irish...", "scale": "4"}, {"review": "In our visit to Raleigh last summer (June 2015), we decided to stop by to see what all the hype was about. I commend the owners for opening a \"Laotion\" restaurant, but overall the food was just way too hyped up and trendy. Small portions lacking in depth is what my wife and I felt about everything that we ordered....", "scale": "2"}, {"review": "It's nearly impossible to get a reservation to Bida Manda, but we finally experienced the wonderful place. The restaurant is always booked solid several weeks in advance; however there are a few walk in tables one can await by getting on the list around 5:30pm the same evening. We tried it and were seated at 6:30pm. It's fairly simple as...", "scale": "5"}], "negativeReviews": [], "url": "http://www.tripadvisor.com/Restaurant_Review-g49463-d3471247-Reviews-Bida_Manda-Raleigh_North_Carolina.html"}, "yelp": {"count": "647", "rating": "4.5", "reviews": [{"review": "WOW...just WOW. Family dinner tonight celebrating many things. Server was Cliff. Trust me, ask for Cliff. Two have been to this restaurant before, while four of us are \"newbies\".", "scale": "5.0"}, {"review": "Hands down the best Asian restaurant in Raleigh, and arguably one of the best restaurants period. The food is incredible (especially the house made, off-menu sausage), the vibe is amazing, the service is top notch, and the bar is wonderful with a forward thinking and ever changing drink menu. Be sure to get here early, or better yet, make a reservation, because this place fills up quickly on a Friday or Saturday night.", "scale": "5.0"}, {"review": "2.5*", "scale": "2.0"}, {"review": "I had to come here twice to make sure I wasn't dreaming I love this this I took my boyfriend here on a date because we both love south East Asian cuisine everything is so tempting however do yourself a favor and get:", "scale": "4.0"}, {"review": "When I was in Raleigh I just knew that I HAD to come here. The reviews are insane and I would soon find out that I would be writing my own 5 star review.", "scale": "5.0"}], "negativeReviews": [{"review": "This place has the worst service I've ever experienced. We were there with a party of 10 for a birthday. One girl ordered a bottle of wine to share with several others and the manager proceeded to come to our table. He told us that no one has ever ordered an entire bottle of wine before (???) and that they were concerned about the girl ordering (38 years old). They didn't feel comfortable with it and therefore we were welcome to eat but they refused to serve our table any alcohol. So we left, went to Sitti and they happily served us a wonderful dinner and several bottles of wine.", "scale": "1.0"}, {"review": "When I first started coming to Bida Manda I enjoyed it. The owners and staff were delightful. However, a couple bad encounters have made me decide to leave them out of my future trips to Raleigh. The owner once needled me about how slow I was eating in order to get me to leave and make room for other guests. On another occasion I had reservations but was seated at a bar that felt like packed sardines instead of a table. Apparently that's an issue with their online reservation system. Overall the mood is unnecessarily snooty and I don't really feel welcome or wanted there. When the place opened the atmosphere was great, but I've stopped recommending the place at all.", "scale": "1.0"}, {"review": "Being a retired chef I review keeping in mind it's not my place of business so I relax my iron grip on many issues, but integrity of and respect for, the ingredients is not one I will ever let go of. I've lived in NC for 14 yrs now and the search (regardless of price) for a quality eatery has gone from frustrating to comical now and so far the best two have been little \"hole in the wall\" places. One is even in the back of an Asian grocery! Simple fresh ingredients cooked to perfection.", "scale": "1.0"}, {"review": "I enjoy all types of Asian foods but bida manda is disappointing. I've been twice, each time the food has been bland or low quality - the duck is so fatty it's barely edible and it is ground up so you can't just cut away the fat. Chicken curry dish was tasteless.", "scale": "1.0"}, {"review": "This review is really more for the owner(s) of this place. It looks like someone's head is getting a little too big. We had reservations for dinner tonight and when we got there, there were 3 hostesses there. The 2 ladies standing on either side greeted me warmly, and the young Asian female at the center, who I'm pretty certain is part of the owning family, just looked at me with a withering look and said, \"Yes?\", as if I'm an annoyance instead of a customer (heaven forbid!). Then she barked at one of the hostesses to seat us. And then when we were leaving, she simply glared at us and didn't even thank or even acknowledge us. I'm not asking for her to hug us or grovel at our feet, but good, freakin' god, she could at least force a smile, especially she's one of the owners!", "scale": "1.0"}], "url": "http://www.yelp.com/biz/bida-manda-raleigh"}}, "name": "Bida Manda", "photo_url": "https://irs2.4sqi.net/img/general/240x240/18794588_UDrFpuWmoAbzM9i8M4Fd-XimYBTdb1-S9I1r3msbMuk.jpg"}}, {"g49463-d444941": {"data": {"foursquare": {"count": "43", "rating": "8.3", "reviews": [{"review": "Meal was delicious from start to finish.   Fried green tomatoes and arugala salad were a great starter.  The seafood grits was outstanding but very close honorable mention to the catfish.", "scale": ""}, {"review": "You can't go wrong with anything. I love their Caesar salad with the grit croutons. I always ask for extra croutons!!", "scale": ""}, {"review": "The Carpet Bagger was excellent. The barnaise sauce is great! For dessert the Pumpkin Bread Pudding was amazing!", "scale": ""}, {"review": "Hands down the best shrimp &amp; grits I've ever had. Soooo flavorful. Comfort food at its finest.", "scale": ""}, {"review": "By far the best meal I've had in a long time. Pork tenderloin and Caesar salad. Both were amazing!", "scale": ""}], "negativeReviews": [], "url": "https://foursquare.com/v/glenwood-grill/4bace827f964a52012183be3"}, "tripadvisor": {"count": "173", "rating": "4.5", "reviews": [{"review": "Decided upon this restaurant while reconnecting with old friends. Perfect menu selections. I had the 8 oz steak hubby had the seafood and grits. Friends had fish. All were excellent! Chocolate bread pudding wrapped up a nice desert. We had outdoor seating and were pleased. Our server was Angelina. She was pleasant, helpful and attended to our every need. Will...", "scale": "5"}, {"review": "Our first night in Raleigh so checked TA for recommendations. Glenwood Grill was close by and well rated so we thought we would give it a try. We sat at the bar and we're waited on by Alex (?). He made a mean manhattan and was spot on with recommendations. We started off with parmasen oysters, which were hot, fresh...", "scale": "5"}, {"review": "I loved the fact that soup, entre and both sides were each delightful in themselves and the whole was better than the components. The She-Crab soup was nearly perfect - just a shade too much sherry and too few crab shards but quite excellent nonetheless. Fried Catfish had an ideal crunchy coating/moist meat thing happening, and the okra relish was...", "scale": "4"}, {"review": "Upon first impression from the outside, Glenwood Grill appears to be another run-of-the-mill strip-mall restaurant. It's when you're inside and seated that you realize, \"This is a cozy, special restaurant with some really excellent menu options!\" Service was efficient and attentive, but the real star at Glenwood is the food, and it is quite amazing. From the fried green tomatoes...", "scale": "5"}, {"review": "This was an occasion out with friends so we suggested Glenwood Grill. It was an old favorite of ours and we wanted our friends to experience it as well. It was very busy, as expected, so we were glad that we made reservations in advance. Out of six people we probably had five different entrees. All were delicious and everyone...", "scale": "5"}], "negativeReviews": [], "url": "http://www.tripadvisor.com/Restaurant_Review-g49463-d444941-Reviews-Glenwood_Grill-Raleigh_North_Carolina.html"}, "yelp": {"count": "174", "rating": "4.5", "reviews": [{"review": "The only 5 star establishment I dined at in the triangle.", "scale": "5.0"}, {"review": "We made reservations for Glenwood Grill for Valentine's Day and we left very satisfied with our experience. I would definitely recommend Glenwood Grill for a romantic date night. It is a smaller restaurant, which makes it feel cozier. However, depending on where your table is, you could end up being pretty close to your neighbors. This doesn't really bother me too much, but I could see that some other people might get bothered. But for Valentine's Day, I think they planned their reservations to leave plenty of time between seatings. Despite, the tables being close together, it never felt too crowded or loud.", "scale": "4.0"}, {"review": "We went to Glenwood Grill for Valentines Day and the food and service were just fantastic. The food was contemporary American, and everything was cooked amazingly well. We started with the oyster Rockefeller dip, and it came with four succulent, fried oysters over a creamy and cheesy spinach dipped served with flat bread. The fried oysters were huge, juicy, and flash fried perfectly without drying them out. The spinach dip was super creamy and cheesy. Definitely not healthy, but tasted amazing with the flat bread.", "scale": "4.0"}, {"review": "\"Delicious gourmet food & preparation in a Glenwood Ave. strip mall\"", "scale": "5.0"}, {"review": "The Glenwood Grill. Wonderful place. I moved into my new home a few miles North off of Glenwood and would sometimes shop at the Harris Teeter that is in the same strip mall plaza. I used to see the Glenwood Grill and thought that I would eventually go by to see the fare. Great food. Good ambiance. Small intimate feel to the restaurant. Romantic. I cannot wait to get a girlfriend or a significant other to bring here. Which goes to my first point of why this place is so great...", "scale": "5.0"}], "negativeReviews": [{"review": "We went here based on the reviews on Yelp and I'm sad to report that the food was NOT good. We got the dinner for two special. The price was fine, the portions were fine (though my boyfriend thought his was quite small), but the food and the wine tasted gross. I got the seafood grits dish and, while yes, the scallop was big, it was also the worst prepared and fishiest tasting scallop I've ever eaten. I actually couldn't finish it, and that's saying something because I love scallops. The shiraz tasted like vinegar, the soup was really gingery (I would have ordered something different, but they didn't mention that it had ginger when they described it) and the dessert was sub par. Never going back.", "scale": "1.0"}, {"review": "One and a half years ago we had dinner at the Glenwood Grill (8 of us). Everything we ordered was top notch. A few days ago my daughter and grandson (6 years old) and I had lunch at the G.G., we were not happy at all. My grandson wanted to leave because it smelled bad, fishy smell. The she soup was fishy tasting, not good. The Thai chicken salad was below OK, the chicken was not seasoned at all, the arugula was not fresh. The shrimp and grits were just OK....there was too much sauce, that's all you could taste. The staff was not friendly. I will not go back there again.", "scale": "1.0"}, {"review": "This was my first time at the restaurant. The ambiance was pleasant, and the host was accommodating. I ordered the Mahi Mahi dish, and it was dry and had no flavor. It was accompanied by goat cheese covered in polenta, and the taste was awful. I should note that both of my friends enjoyed their meals...one ordered the crab cakes and the other ordered the salmon. Honestly, the only reason I decided to write a review is b/c the waiter was rude, aloof and not at all apologetic when I returned the meal. I've never done that before and was quite embarrassed about doing so; but, for a $19 meal, I believe I deserved higher quality. Also, this waiter stared out of the window while taking our order and seemed preoccupied and bored. I will never dine here again.", "scale": "1.0"}, {"review": "I came to this place just because of the reviews and what a disappointment! Although the atmosphere was nice the food was awful! I asked for a flounder salad ( special of the day) and I got a bow of greens with a little oily fried fish on top! The fish didn't have any season whatsoever and tasted old and frozen!! The waiter didn't care about us and didn't even bother to refill our drinks! I don't recommend this place for anyone! Mac Donald's salad is way better than that one!", "scale": "1.0"}, {"review": "After reading all of the great reviews 4.5 stars I thought it would be a great place for lunch. When we got there it seemed pretty nice and so we were seated very quickly and that was great. The waiter was an older guy they seemed he wanted to be there and I usually drink a lot of sodas which I only got one refill which I thought was terrible. The food was just as bad as our waiter the flounder was square like it was frozen and it was so oily and my steak wraps where just as bad they say in the menu the steak is filet which it wasn't tasted more like sirloin at best. Prices was high for what you get, I think kick back jacks has by far better food.", "scale": "1.0"}], "url": "http://www.yelp.com/biz/glenwood-grill-raleigh"}}, "name": "Glenwood Grill", "photo_url": "https://irs1.4sqi.net/img/general/240x240/37836002_H_SF2SsO4AMzY9hhnsBqZP6p-4sSezf3MGDJB3OPLwQ.jpg"}}, {"g49463-d4112217": {"data": {"foursquare": {"count": "458", "rating": "8.9", "reviews": [{"review": "Ordered the Mushroom Swiss burger and an onion ring appetizer today. The onion rings were really well done and not greasy at all. The burger was okay but I ordered medium rare and was more medium.", "scale": ""}, {"review": "Seriouslyget one of the bento boxes. It's perfect if you want to try a burger and some sushi. (Sweet potato fries and sea-salted edamame included!) There's a build-your-own sushi roll option, too!", "scale": ""}, {"review": "What a great fusion of two great worlds - burgers &amp; sushi! The North Hills Roll is amazing - Try it! If you are looking to buy or sell a home in the North Hills area of Raleigh; RaleighRed can help! Read more", "scale": ""}, {"review": "Great place to go if you have any type of food allergies.  Make your own roll was the best idea ever.  Not the most traditional sushi place but they don't try to be.  Great food and great service.", "scale": ""}, {"review": "The weekly mini burger is the perfect way to experience burger choices from the menu. Bento box gives you a taste from both worlds. Great 5.-6.00 kid meals that include a drink! Happy family!", "scale": ""}], "negativeReviews": [], "url": "https://foursquare.com/v/the-cowfish-sushi-burger-bar/512fae5be4b01e7458f3057a"}, "tripadvisor": {"count": "320", "rating": "4.5", "reviews": [{"review": "The Cowfish Sushi Burger Bar truly has something for everybody. Their menu is like the Cliffs Notes edition of War and Peace. I recommend checking it out online and write down any questions before you come to the restaurant. Since Cow is the first part of the name of the place, I ordered a burger which was fantastic. Others in...", "scale": "4"}, {"review": "To this day, it is definitely a place you recommend to your friends. Amazing location and atmosphere and love the HUGE salt water tank.\nFinally tried a bento box lunch and it is my new favorite. You get to try a mini burger and sushi. YUM. (mini burger was cooked well, so I will ask them to adjust that next...", "scale": "5"}, {"review": "Went to Cowfish last night with our three kids (17, 15 & 11) and it was a blast. Maddie was a very attentive waitress and provided great service. The decor is so fun and creative, with an enormous aquarium in the middle - sporting a giant martini glass. I wonder if it was maybe made by the guys in Tanked?...", "scale": "4"}, {"review": "It's hard to believe that sushi and burgers works, but it works amazingly. We ordered the Tropical Firestorm sushi. It was amazing and stunning. But the burgers are so flavorful and huge. We tried the Hunka Hunka, the Arnold and the Borsin and bacon burgers. All were amazing. The sweet potato fries are a great side choice too. For dessert...", "scale": "5"}, {"review": "Had a great dinner with coworkers. It didn't hurt that us winter-weary northerners were able to eat outside in the 80 degree twilight. Service was friendly but unattentive.", "scale": "4"}], "negativeReviews": [], "url": "http://www.tripadvisor.com/Restaurant_Review-g49463-d4112217-Reviews-The_Cowfish_Sushi_Burger_Bar-Raleigh_North_Carolina.html"}, "yelp": {"count": "614", "rating": "4.5", "reviews": [{"review": "The mysterious cowfish was always ridiculously packed with people so I've stayed away until last night. Arrives around 630. As expected its packed. Wifey, who does not like to wait gives me the negative Nancy again after letting me choose tknights restaurant.", "scale": "5.0"}, {"review": "A friend and I dined there last night and sat at the bar. We were warmly greeted by the bartender Krystal and given drink menus. They specialize in craft cocktails so I ordered a Bullet and Bacon. It is a variation on an old fashioned and was quite tasty. We ordered sushi (tuna rolls and spider roll). I was a bit disappointed in the spider roll because it only had one crisp in the rolls otherwise it looked just like regular sushi.", "scale": "3.0"}, {"review": "Sweet potato fries here are on point!! Crunchy and crispy, yum!", "scale": "4.0"}, {"review": "I'm a fan of their Bento Box, since it combines both burger and sushi elements into one dish. You get a slider burger with some sushi, sweet potato fries, edamame, and pickled cucumbers.", "scale": "4.0"}, {"review": "I'll admit it : I was skeptical. A place that can do both sushi and burgers well? Sushi in North Carolina? The Cowfish can deliver!", "scale": "5.0"}], "negativeReviews": [{"review": "I was there on the 22nd with my wife celebrating our anniversary. We ordered the Ahi Nachos for app. She ordered a avacado Turkey burger and I ordered the Bento \"Brento\" Box. That night everything was great. Service, atmosphere, etc... It wasnt until later that night I knew something was wrong. I got food poisoning from my Bento box which contained sushi and a burger. Altough the place was awesome I will not be returning. After what I just went through I would advise all to steer clear!", "scale": "1.0"}, {"review": "If your in the mood for Sushi then let me suggest MURA right across Six Forks, the sashimi is poorly cut, usually over sized chunks of raw fish, nasty & gross! As far as appetizers, the only one I could suggest is the Togarashi shrimp, beyond that your just wasting your money. The spiked shakes are a definite let down, just sugary concoctions that would kill a diabetic. The best reason to go here is to see the fish tank & perhaps some of the burgers, beyond that not worth the wait or the cash!", "scale": "1.0"}, {"review": "Noisy,poor air quality,long wait in line for a 10 dollar burger that made my daughter very sick. I dont know anything positive to say about this place.", "scale": "1.0"}, {"review": "I used to love Cowfish. I really did. We visited so often, I was the Duchess for awhile. After our 13th visit or so, it started going downhill. Service was slow. Tables and floor were dirty. Waiters were absent minded. One visit in particular, my husband ordered the Arnold burger. The egg is supposed to be served yolky and runny, instead he got something that looked more like a deviled egg. Gross. We sent it back. The waiter also got his side order wrong. He is brought a fresh plate of sweet potato fries, but no burger. 10, 20, 30 minutes go by. My food is cold because I'm not going to eat without him. I finally spot the waiter, ask him what's up. He says he'll check on it. The look on his face says more he forgot. By this time, I'm over it. I flag down the manager, inform her, she makes it seem like it's favor she's comping the meal. The meal we didn't even get to eat. She asks us to wait, 5 minutes later, his meal is brought out fresh in a to go box. Like it had just been made, not 30 minutes ago when it was sent back. Ugh. Like that's not bad enough we were seated by the waiter station in the corner and had to listen to the waiters complain about \"what a dumb b**ch the Hostess was for mixing up tables\" Cute.", "scale": "1.0"}, {"review": "Excellent place to go for food BUT their waiting system list is super slow. I waited today for more than hour and a half. I saw groups coming after me seating first on my face and that is not acceptable.", "scale": "1.0"}], "url": "http://www.yelp.com/biz/the-cowfish-sushi-burger-bar-raleigh"}}, "name": "The Cowfish Sushi Burger Bar", "photo_url": "https://irs1.4sqi.net/img/general/240x240/9337_q_3J4kzZyyjx-RrYKHxHpPeUbGEjG-Jgopp5YQ1zjmk.jpg"}}, {"g49463-d6407240": {"data": {"foursquare": {"count": "19", "rating": "8.4", "reviews": [{"review": "The lunch special combo is a great deal! An entree, rice/noodles, and an egg roll for $6.25. Make sure to try their sesame chicken!", "scale": ""}, {"review": "Green curry is awesome. String bean chicken extra spicy off the lunch specials.", "scale": ""}, {"review": "This is the best Chinese restaurant in the area. Love the food here.", "scale": ""}, {"review": "Excellent Thai and Chinese. Best in Raleigh", "scale": ""}, {"review": "Great food and the service is good too!", "scale": ""}], "negativeReviews": [], "url": "https://foursquare.com/v/red-pepper-asian/531cde03498ecda932de475c"}, "tripadvisor": {"count": "23", "rating": "4.5", "reviews": [{"review": "Small and quaint with consistently great food on each visit. Great for lunch, dinner or take out. Much needed in the area.", "scale": "5"}, {"review": "We went to Red Pepper Asian based of the reviews. The food was great and everyone was very friendly. I will definitely be back. They have the freshest tasting egg rolls I've every had.", "scale": "4"}, {"review": "The Red Pepper is the Fortune Palace reborn. The Red Pepper is smaller than the Fortune Palace, but the owner and staff are very accommodating. Those that call the Red Pepper an\"American\" version of Chinese food don't know how to order. I entertained people from China at the Fortune Palace, they didn't want to go anywhere else.", "scale": "5"}, {"review": "If you ever tried the Fortune Palace on Capital and you liked it, then you'll love this place. Fortune palace owners sold their business a few years ago and recently just opened this much smaller version. Menu is smaller, not as much selection but still very good. The Calamari is very popular because they use Cuttlefish instead of regular Squid....", "scale": "5"}, {"review": "Thank god I had google maps to get me there, otherwise I would not have found it. When I got there, the parking lot was empty but it quickly filled up. The food was standard american versions of Chinese food, which was tasty and satisfactory, but I will probably try to find another Chinese restaurant with more imagination.", "scale": "3"}], "negativeReviews": [], "url": "http://www.tripadvisor.com/Restaurant_Review-g49463-d6407240-Reviews-Red_Pepper_Asian-Raleigh_North_Carolina.html"}, "yelp": {"count": "72", "rating": "4.5", "reviews": [{"review": "This little gem is definitely tucked away. You can't see it from the main street or any street really and the only way I even found out about it was from other reviewers.", "scale": "5.0"}, {"review": "Tucked away in an area far far away...in Raleigh. This is a hidden gem on New Bern Avenue in a quite shopping area. The inside is well decorated and clean. The menu is unique with just the perfect number of items to choose from.", "scale": "4.0"}, {"review": "I've been to Red Pepper about 10 times and have never been disappointed with the quality of the food or the service. Both are top-rate.", "scale": "5.0"}, {"review": "Sunday night and Husband actually uttered the words that he was hankering for Asian (not a common occurrence)...so I went with it, fast! Searched \"best Asian\" here and was drawn right into reviews and pics from this place. Off we went, unsure of where exactly. Let me clarify:", "scale": "4.0"}, {"review": "A really good Chinese restaurant in East Raleigh Considering that much of this area is filled with walmarts, chain restaurants and general sketchiness, I was shocked to find this place. Don't be deterred by the strip mall location-it's actually really cute inside and the food is awesome.", "scale": "4.0"}], "negativeReviews": [{"review": "Service: Just the basics. Order taking, food delivery to the table, and the check. Nice enough.", "scale": "2.0"}, {"review": "After a couple of very disappointing visits, I barely can give this restaurant 2 stars. I feel obligated to rate it though, as the highly inflated ratings are totally not deserved at all from my perspective. I definitely expect so much more from a restaurant of this type.  Even though it is hard to get great Chinese and Asian food in the area, this place seems to fall way short of other places we prefer in the Triangle. It seems as if they are more concerned about collecting money here while delivering small portions, mediocre food, and service, instead of putting any love, passion, and care into their food and service.", "scale": "2.0"}, {"review": "Since moving to this side of Raleigh, I haven't found a good chinese restaurant. I love good chinese food, but it can be really hard to find. I decided to try Red Pepper Asian, because it had great reviews. The more diverse menu also attracted me.", "scale": "2.0"}, {"review": "Ok if I really want some Asian food. Conveniently located right off 64 between jersey mikes and Hamricks. Take out is pretty quick and accurate. I do like that they have lunch specials on Saturday too.", "scale": "3.0"}, {"review": "I'm disappointed in this place after my second visit.", "scale": "3.0"}], "url": "http://www.yelp.com/biz/red-pepper-asian-raleigh"}}, "name": "Red Pepper Asian", "photo_url": "https://irs2.4sqi.net/img/general/240x240/139392214_SP4HHMse8ltF1FYORTveycXhF6aJjS0MI3FKR_WlzSg.jpg"}}, {"g49463-d6610534": {"data": {"foursquare": {"count": "79", "rating": "9.0", "reviews": [{"review": "The bartenders are mixing some great cocktails like \"Saving Grace\" and \"The Last Word\".  Crunchy potato &amp; arugula salad is my favorite on the menu.  Can't wait to come back and try the pizzas.", "scale": ""}, {"review": "Amazing place! Warm, friendly atmosphere. Everything we ordered was incredible: kale salad , goat cheese dip with brick oven bread, and sausage and honey pizza. Service was beyond excellent.", "scale": ""}, {"review": "Brick oven broccoli, cast iron goat cheese (ask for extra bread), spicy sausage &amp; black pepper honey pizza finish with chocolate budino.... amazing", "scale": ""}, {"review": "Great place for dinner. Brussel Sprouts were delicious, along with the stuffed chicken. Top off the night with the budino or gelato, really can't go wrong.", "scale": ""}, {"review": "Savory food. Beware of cross contamination, they are not careful. I have dairy and nut allergies and left with an inflamed face after the meal.", "scale": ""}], "negativeReviews": [], "url": "https://foursquare.com/v/tazza-kitchen-cameron-village/528a6b0e11d27a62a2728622"}, "tripadvisor": {"count": "64", "rating": "4.5", "reviews": [{"review": "Even on a Monday we needed a reservation! The waitress was very patient with our group and let us try a number of beers until we found just the right one. She gave us good advice on ordering as well. Not an unhappy person in our group. We all ordered something different and EVERYTHING was awesome and cheap. Crab cakes...", "scale": "5"}, {"review": "Ate at Tazza again and once again it did not disappoint! The salad I ordered before, I had again and it was just as amazing. My entree was delicious and perfectly prepared. Service is also top notch. There typically is a wait, so be prepared. But it is definitely worth the wait!!", "scale": "5"}, {"review": "I'm going to be honest, I'm a pain in the butt when it comes to restaurants. I'm rarely every happy or enthusiastic but our meal here was one of the best ones we have had all year. As a chain, it pains me to be so enthusiastic but literally every dish that every one of us got was great! Service...", "scale": "5"}, {"review": "This is a good casual dining restaurant. They have a short menu selection. We each had the wood fired pizzas. Each was good. The sausage, cheese and honey was really good. They have a nice craft beer menu. The wine menu is limited but is has Murillo choices at a fair price. The decor is very open; a bit noisy...", "scale": "4"}, {"review": "Food was really good - especially the melted goat cheese in a skillet. Service was average, but in fairness the restaurant was packed. Not a great place to have conversation - super noisy - but if you like to be in the middle of everything, then it's a great choice!", "scale": "4"}], "negativeReviews": [], "url": "http://www.tripadvisor.com/Restaurant_Review-g49463-d6610534-Reviews-Tazza_Kitchen_Cameron_Village-Raleigh_North_Carolina.html"}, "yelp": {"count": "177", "rating": "4.5", "reviews": [{"review": "Long delayed visit to Tazza Kitchen in Cameron Village and it was great.", "scale": "5.0"}, {"review": "Coworkers and I were in town for work and decided to give Tazza a try. We were seated pretty quickly and our waitress was nice.", "scale": "3.0"}, {"review": "Spectacular dinner everything we ordered was super delicious ... We must comeback pizza", "scale": "5.0"}, {"review": "I FINALLY got to try the Spicy Sausage and Black Pepper Honey pizza that everyone has been raving about! If other restaurants are smart, they'll start having honey as a toppings option also. The contrast between the spicy sausage and the black pepper with the sweet honey worked amazingly. Another thing that I really like about Tazza's pizzas is that they have very thin crusts. It makes the pizza not too filling and I don't feel like I'm in a food coma when I finish, unlike my experiences at most pizza places. I wouldn't recommend these pizzas for sharing, unless you are ordering some other items, because of this reason (And also because it is just too good to share). But another thing with them having such a thin crust, is that the weight of the toppings and cheese overpower it a bit, so the crust went somewhat limp. But it really does taste amazing.", "scale": "4.0"}, {"review": "Great food, the tortellini with the creamy basil pesto sauce was my favorite. I like it because when we visit my daughter at NC State this is a place we can go without having to worry about parking.", "scale": "4.0"}], "negativeReviews": [{"review": "This may be my first one star review but it was terrible!! The water pitcher on our table was growing stuff. My pizza came out with completely raw eggs TWICE. We're taking clear jiggly egg whites...! I then went for the marghrita pizza which was bland. The dessert cream puffs then came out with a dead bug on them! It's a good thing the manager offered to comp the meal because we weren't paying for one of the worst meals we've ever had!", "scale": "1.0"}, {"review": "My friends and I went to Tazza tonight for dinner for the first time at the recommendation of another friend. Drinks and apps took a while to get, but were delicious. Then, however, things went sour. Two of my friends ordered the pizza with arugula salad on it and BOTH pizzas came out with bugs in them. The person who brought the pizzas out didn't even care about the bugs, just took that piece of lettuce away and asked if they wanted more arugula. GROSS. The manager came out and replaced their pizzas, but then things got worse. After the new pizzas came out, we realized there were ROACHES crawling all over the patio. Big roaches. Everywhere. The kicker- we still had to pay for the entire meal- drinks, apps, entres, everything except the two bug-arugula pizzas. By the end of the ordeal, we didn't even want to stick around to contest the bill, we just wanted to leave as soon as possible. We do not recommend.", "scale": "1.0"}, {"review": "It was ok. Scallop dish was very bland and under cooked. Potato app was nothing special. The pizzas and salads looked really good though. Maybe we ordered the wrong thing?!", "scale": "2.0"}, {"review": "We visited tazza kitchen on a Friday night for dinner. We started off the meal with an awkwardly taken drink order and an order of baked oysters. The oysters were small, the textures didn't blend. They were boring.", "scale": "2.0"}, {"review": "So my experience at Tazza was very disappointing! I will start off with the positives:", "scale": "2.0"}], "url": "http://www.yelp.com/biz/tazza-kitchen-cameron-village-raleigh"}}, "name": "Tazza Kitchen Cameron Village", "photo_url": "https://irs2.4sqi.net/img/general/240x240/75809039_U-ip5Sf4OEAWi-atPUmKNZ9eSSQUcBE6RowtwDti8Sw.jpg"}}, {"g49463-d8023813": {"data": {"foursquare": {"count": "74", "rating": "8.4", "reviews": [{"review": "Check-in three times and unlock the Kamado Grille VIP package!", "scale": ""}, {"review": "Such an amazing inside atmosphere! The lobster roll and fresh fruit hit the spot on a hot day!  I also enjoyed the watermelon cocktail which was refreshing. Try the house made ice cream too!", "scale": ""}, {"review": "Pork bomb is very good ! The manager gave us a tour of the kitchen. Everything is really cooked on the grills 12 in back 3 out front ! Amazing!", "scale": ""}, {"review": "Get a reservation or call ahead.  Avoid weekend/Saturday night.  This is open on Sunday.  Try spicy margarita", "scale": ""}, {"review": "Wonderful restaurant. The ribeye and cheese grits are outstanding. Great staff too!", "scale": ""}], "negativeReviews": [], "url": "https://foursquare.com/v/kamado-grille/55416c15498e88d7fe167266"}, "tripadvisor": {"count": "103", "rating": "4.5", "reviews": [{"review": "We met our friends at this spacious and contemporary restaurant for dinner. The relaxed environment is inviting. However, it took us a while to figure out the ordering system via IPad. We had too many special requests therefore ended up calling our waiter too many times. They use a special grill for cooking the meat for the smoky flavor. The...", "scale": "4"}, {"review": "Had no idea what to expect but it definitely exceeded my expectations! Everything is cooked on, rather IN their kamado grills. I got the Black Angus Coulotte and it was cooked to perfection (and I'm a meat snob). We also got a bunch of appetizers for the group and everything was fantastic (all of the flatbreads and wings). They even...", "scale": "5"}, {"review": "Driving down the street the previous night, I figured this was a new Asian restaurant, since my last visit to Raleigh. Not so; it's the name of the cooker they use to make the meals. Hope that the word gets out, and that the name of this restaurant doesn't hamper visitors.\nVery dead on a Sunday night, but understand that...", "scale": "4"}, {"review": "They just started serving on Sunday this past weekend and I suggest to my wife that we give it a try after church. First of all when you walk in the restaurant, it has a nice airy wide open feel, I like that! Next the people, we were greeted at the door and each of the staff we talked with...", "scale": "5"}, {"review": "Went out to lunch and the food was great. The atmosphere is wonderful and staff very friendly. The shrimp and grits was scrumptious.", "scale": "5"}], "negativeReviews": [], "url": "http://www.tripadvisor.com/Restaurant_Review-g49463-d8023813-Reviews-Kamado_Grille-Raleigh_North_Carolina.html"}, "yelp": {"count": "147", "rating": "4.0", "reviews": [{"review": "I have been here a few times and I have loved it each time. This is a meat lovers dream for food.", "scale": "5.0"}, {"review": "Tried this place today for the first time with the girls. They were running a lunch special consisting of a choice of 1/2 flatbread with a side salad or soup, We all got the special with different flatbreads: Ocean Blast, #12 chicken, and the short rib, all with salad.", "scale": "3.0"}, {"review": "Fun fun vibrant atmosphere !!!", "scale": "4.0"}, {"review": "I'm giving Kamado Grille four stars for the food but the service would be rated 2 stars. I had read all of these reviews about the use of technology to order your food and how that set Kamado Grille apart from other dining experiences. I made an online reservation for 6pm, and we arrived right at 6pm.", "scale": "4.0"}, {"review": "3.5", "scale": "3.0"}], "negativeReviews": [{"review": "Was very pleased with the inside very light and open. Pork belly slider Appetizer was great! Ordered the chicken flatbread as an entree and my husband ordered the steak. They didn't let his steak rest before cutting and my flatbread was way too saucy. I sent the flatbread back. Didn't want any other item from their menu. At no point did they offer to take the flatbread off our bill. Therefore I am giving it one star. Very upset we live so close and we we're looking forward to having a new restaurant nearby.", "scale": "1.0"}, {"review": "I have been excited seeing Kamado grill being built. It looked like a unique and different experience and that is always a good idea. Unfortunately, this isn't it. The bad out weighted the good in so many ways. My girlfriend and I decided to take the kids to check this place out Saturday, May 9th. I looked at there website and it said reservations not needed but recommended. I thought since we had five I better call just in case. I called and asked if they had a 5:30 spot. I was told that we could be squeezed in and they would see use then. We got to the restaurant about 5:25. I went to the server and said my name and we had reservations. She said \"That's good because we only take reservations\". I told her they might want to clarify that on their website and immediately had attitude thrown at me. Just trying to help...anyway she found the reservation and said \"yes we have you here\" and that was it. No waiting a moment, no we can seat you now, just a blank stare. So I asked \"do we wait?\"  The hostess says \"it will be a while. We have to get a table for you.\" You take the reservation, but do you hold the reservation... we hang out in the foyer and about fifteen minutes later we are finally sat.", "scale": "1.0"}, {"review": "Made reservations for 8PM on a Saturday. Walked in and we were seated within 6-8 minutes. Apparently, there was a party on the patio thus causing all of the tables that balanced between the patio and inside, to all be shoved inside. We were seated by the bathrooms on the high-top tables and it was the most obnoxious spot. It was extremely high traffic with the bathrooms and kitchen in the same corner. This situation bothered us because this was our one date night to relax and enjoy each other's company but people kept bumping into our table and it was SO LOUD. We eventually moved more inside the table (it was a 4 seater) versus the two outside spots. Environment was bad. I started with a side Caesar salad. It was heavily covered in a flavorless Caesar dressing (I think they omitted the zing from the anchovies) with tons of shredded cheese and croutons (that were not bad). For appetizer we started with the NZ Lamb Lollipops. 0/5 stars. They were raw which we did not order, they weren't seasoned well, they were served mildly warm, and the meat wasn't even tender. We threw 2 of them away. The grits were whatever. Nothing to rave about and because they were only mildly warm they weren't even decent. After the table situation and lollipop crap, we decided to share a meal and thank goodness we did because again HORRIBLE! We shared the St. Louis Style Ribs. The seasoning was crap, the meat was not tender or juicy (pretty dry honestly), and again it was served mildly warm. We chose the Smoked Gouda Mashed potatoes. No these were not \"mashed\" they were pulverized to a sloppy mess to the consistency of pudding just sloppily displayed on the plate. The pictures showed them somewhat chunky. Not that I'm a huge fan of Chili's, but even a CHAIN restaurant has better mashed potatoes. The server was kind enough to sample out all 4 sauces with our meal. ALL 4 WERE HORRIBLE!!! I think the worst was the rootbeer. It was literally a sugary, tomato, BBQ sauce. I couldn't even cover up my nasty meat with a good sauce to hide the taste. Not ONE SINGLE PART OF OUR MEAL WAS EVEN DECENT. WE THREW AWAY MOST OF OUR FOOD. We did however order 2 martinis and the \"Paradise\" drink (not the exact name but I couldn't find online). Compliments to the bartender because they were awesome! We were actually saving room for dessert, but after the ribs, we decided it was not going to be worth it and agreed to stop at Harris Teeter for some Ben & Jerry's that we knew was safe.", "scale": "1.0"}, {"review": "Will not return. Was seated immediately on a Monday night. Tables are equipped with iPads for ordering your food. Lots if glitches. Very little, if any, server interactions but still expect to leave a tip. Food came out fast, ordered ribs. Menu did not indicate if full rack or half but for the price I assumed it was a full rack. Wrong, barely half rack, very dry and sauce choice not great. Husband ordered NY Strip medium well. Chewy meat and there are no condiments at tables nor how to order on iPad. Had to call server via iPad but no one showed up. Finally waived arms in air, got the attention of our server, asked for steak sauce and he brings a bottle, an empty bottle of steak sauce. Of course he left immediately after putting it down so no time to say, hey it's empty. Will not return ever, not a deal for your buck.", "scale": "1.0"}, {"review": "I'm really upset the way this place is managed. They do not take reservatio s but only have call aheads. We called ahead almost an hour before we got there and put our name down, got there waited 30 mins and still did not get a table.", "scale": "1.0"}], "url": "http://www.yelp.com/biz/kamado-grille-raleigh"}}, "name": "Kamado Grille", "photo_url": "https://irs1.4sqi.net/img/general/240x240/130581812_mJ95jZISyguC2klLsnRyiZUjwTaITW8HRbZSBxnayhg.jpg"}}, {"g49463-d828082": {"data": {"foursquare": {"count": "65", "rating": "8.9", "reviews": [{"review": "Everything is fantastic. Try the pretzels, try the spatzle, try the pierogi, the venison meatballs, dont skip the schnitzel. The desserts are out of this world, as well. I'll be returning to try more!", "scale": ""}, {"review": "Today I had the mushroom and cabbage pierogies as an appetizer, then ordered their classic cheeseburger with a side of fries and a paprika mayo to dip them in. Bang on good!!", "scale": ""}, {"review": "Never have had a bad thing here, but you can't leave without having the Chocolate-Hazelnut Torte with Sea Salt, Caramel, and Bacon. Sounds crazy but it's AMAZING.", "scale": ""}, {"review": "J. Betski's is the only area restaurant specializing in German and Polish cuisines, delivering exemplary renditions of both traditional dishes and innovative riffs. Read more", "scale": ""}, {"review": "Best german food of my life. Its better than what you probably know german food to be. Throw a dart at the menu, sit back and enjoy.", "scale": ""}], "negativeReviews": [], "url": "https://foursquare.com/v/j-betskis/4b3b8c41f964a520947525e3"}, "tripadvisor": {"count": "188", "rating": "4.5", "reviews": [{"review": "The best German - Austrian dishes I've eaten -- certainly a plus for Raleigh! Their weinkraut is terrific. And the sausages go great -- terrific breads too. Not to mention the desserts!", "scale": "5"}, {"review": "Visited Raleigh for the first time in 40 years this past weekend. My wife is Ukranian and she found a good review on TripAdvisor for Polish food at J Betski's so we gave it a try. Oh boy were they right on the money with the \"fantastic food\" reviews! I have been enjoying Uky/Polish food with my wife for 25...", "scale": "5"}, {"review": "This was not my first visit to Betski's, but I have not been here for a number of years. It was still as good as I remembered it!\nYou sense the great dining atmosphere as you walk into this German/ Polish restaurant. We had a reservation (it will help to have one), and we were seated immediately.\nThe first thing...", "scale": "5"}, {"review": "I come here regularly. Located in Seaboard station J Betski's offers a nice selection of Polish and German offerings with a very respectable beer selection. Compared to other German restaurants the menu is much smaller with more of a focus on quality than quantity. J Betski's leans more toward upscale than \"olde world\" so abandon any hopes of hearing an...", "scale": "5"}, {"review": "Made a reservation and was promptly seated. Great service with friendly informative waiter. All of the recommendations were spot on and the food was fantastic. Pierogis were amazing and and veal chop was delicious. But the dessert was something out of this world. Chocolate, Carmel, bacon and decadence. Well go back for everything and if nothing else dessert. The outdoor...", "scale": "5"}], "negativeReviews": [], "url": "http://www.tripadvisor.com/Restaurant_Review-g49463-d828082-Reviews-J_Betski_s-Raleigh_North_Carolina.html"}, "yelp": {"count": "231", "rating": "4.5", "reviews": [{"review": "We've been to J Betski's a couple of times now and are definitely fans. The first time was on Valentine's Day with a pre-set menu, and the most recent time was just a random date night. Both times, the food and service have been top notch. I'm not sure I would classify J Betski's as a classy or elegant restaurant and feel like going in your jeans on a date night is perfectly fine. There were a couple of tables that were a bit more dressed up, but to be honest, the atmosphere and semi-close quarters do not warrant any type of extra fancy outfit.", "scale": "5.0"}, {"review": "I had dinner here a few weeks ago and it was overall a great experience! The service was great, the food was fantastic and the company was good too!", "scale": "4.0"}, {"review": "Very, very good. Very small inside but good food. I've been here for lunch and for dinner - I can say dinner is the best. Lunch isn't bad, just not as good as dinner and not as many options.", "scale": "4.0"}, {"review": "J. Betski's is a German and Polish and then a touch of modern fusion mixed in. You absolutely have to order the pierogi and they were the best part of the meal. They were filled with pumpkin and cheese and so good we had to order another plate for the table.", "scale": "4.0"}, {"review": "I'm not a huge fan of this type of food, so I came here at the request of my husband. Veal was flavorful and service was great. Loved this place!", "scale": "5.0"}], "negativeReviews": [{"review": "We walked with our dog to the restaurant on a Friday night, a night advertised as a dog friendly night at seaboard station with music outside, outdoor seating, etc. When we got there they told us they weren't serving outside. That would have been fine, but they wouldn't even let us order at the bar and sit outside at the tables where they normally serve and allow dogs. I can honestly say this is the first time ive ever been turned away from a restaurant where I was trying to spend money, especially one in my neighborhood. It made it all the more unbelievable that even after offering to go back and forth to the bar to serve ourselves. Unbelievably bad customer service, and I can assure you I won't be going back to eat there again.", "scale": "1.0"}, {"review": "The food maybe spectacular, I'll never know...", "scale": "1.0"}, {"review": "After reading great reviews I was very disappointed with my visit. The ambiance was nice but other than that I cannot give this place a good review especially when my bill for 1 appetizer and a main dish of 3 perogies costs $40. The food was the biggest disappointment it was cold and the flavors did not blend well. Maybe it was just a bad night for the kitchen but I won't be returning. Portions are too small and service was too slow.", "scale": "1.0"}, {"review": "Mediocre food. The spetzle was very bland and had a taste of polyurethane. The building also smelled like it too (you know the lacker on hardwood floors that makes it shiny). The brats were okay. Nothing to phone home about. Won't be returning. Instead I prefer German Grille in Cary for my German fix. That place was great.", "scale": "1.0"}, {"review": "I was so excited to go here. I have been wanting to try it for months as German food and beer is a favorite of mine.", "scale": "1.0"}], "url": "http://www.yelp.com/biz/j-betskis-raleigh"}}, "name": "J Betski’s", "photo_url": "https://irs2.4sqi.net/img/general/240x240/v-1Ue2PfO1ILtaOe7Ql5VLn8tHu3jXdCTRsXo6rsTGM.jpg"}}, {"g49463-d2281435": {"data": {"foursquare": {"count": "439", "rating": "9.3", "reviews": [{"review": "The fried chicken is good, but the Mac and cheese is a standout.", "scale": ""}, {"review": "Best chicken pot pie I've ever had in my life!", "scale": ""}, {"review": "The pimento mac and cheese is phenomenal.", "scale": ""}, {"review": "Mac and cheese is divine", "scale": ""}, {"review": "Fried chicken, cole slaw, biscuits and a local craft beer. Can't go wrong, or ask the staff, they're super friendly and helpful.", "scale": ""}], "negativeReviews": [], "url": "https://foursquare.com/v/beasleys-chicken--honey/4e091acc1f6e21103396e069"}, "tripadvisor": {"count": "364", "rating": "4.5", "reviews": [{"review": "If I could just review the food, I'd give it 5 stars. It was really tasty and I highly recommend it. The only reason I went here was because as I walking around downtown Raleigh saturday morning, I saw a line starting to form in front of it before it opened and I figured it had to be good. I...", "scale": "3"}, {"review": "Menu is short and direct to the point: homemade fried chicken with a nice selection of sides. They also had a kind of fish and chips, not in the menu, which was very tasteful. Nice selection of wines and beers to accompany the food, and friendly service. Place is always full, which reinforces its reputation - but usually you won't...", "scale": "4"}, {"review": "The cole slaw, chicken, and honey biscuits are to die for. The beer complimented the meal very well.", "scale": "5"}, {"review": "I was not disappointed. Fried chicken and waffle was wonderful. I loved the Mac and cheese as well. Not too happy with the cocktail, however I can't fault them because they took it off bill when I complained. Loved it.", "scale": "5"}, {"review": "This is what I want when I come to the south. Great southern comfort foods. The chicken was tremendous and great selection of sides and we tried most of them. Very reasonably priced as well.", "scale": "5"}], "negativeReviews": [], "url": "http://www.tripadvisor.com/Restaurant_Review-g49463-d2281435-Reviews-Beasley_s_Chicken_Honey-Raleigh_North_Carolina.html"}, "yelp": {"count": "761", "rating": "4.0", "reviews": [{"review": "Look at me, I almost made a healthy choice. I went with the veggie sandwich, which was a very nice stack of sprouts and tomato and avocado and more, plus two thick slices of a sharp cheddar cheese on a store-made toasted sourdough. A VERY good sandwich.", "scale": "5.0"}, {"review": "Brunch looked enticing, but for my virgin visit had to go with the signature Fried Chicken and Waffles w/Honey. It did not disappoint - check another thing off the bucket list.", "scale": "4.0"}, {"review": "I've been trying to go here for ages, but it always seems packed and they of course don't take reservations like all of the other Ashley Christensen restaurants. I guess the odds were in my favor, because my fianc and I showed up about 8:45 PM on a Saturday to no wait and a stellar table right by the window. I should have known it was going to be an amazing evening.", "scale": "4.0"}, {"review": "Fried chicken and waffles is one of weirdest, yet greatest food combinations ever made and Beasley's does it really well. The fried chicken is so crispy and the seasoning in the coating is so good. It really isn't your average fried chicken, and when drizzled with their honey syrup sauce, it's the perfect balance of sweet, salty, and savory. It's almost a must to get the combo with the waffle. The waffle is light and fluffy, and does great to contrast the crispiness of the fried chicken. Just cover everything in that honey sauce and you'll be good to go. They also do a pretty good job with their sides too. I've tried their mac n cheese, and sweet potato sides and both were delicious.The sweet potato sides go great with the honey sauce as well.", "scale": "4.0"}, {"review": "This was our first stop in our visit to Raleigh last weekend! It's pretty trendy and the few times that we walked by it I noticed that there was always a wait. We came for a pretty late lunch, so we got lucky with a couple seats at the bar. If you like fried chicken and comfort food, this is the place to go in downtown Raleigh. The menu is pretty simple, but it works. They have everything up on the wall: fried chicken, chicken and waffles, and side dishes. We got a 1/4 white meat with 3 sides- and it was more than enough for the two of us! First of all, the food arrived in less than 5 minutes after ordering (talk about service)! The chicken was fresh, juicy, and full of flavor. I am pretty picky about chicken because it can be so bland, but I thought it was great! We got the biscuits, which were lightly covered in honey and they were probably my favorite part of the meal. The mashed potatoes were yummy, but nothing to brag home about. The mac n cheese blob was... interesting? It tasted good and had small bits pepper, but the texture was just too weird for me. It was very thick like jello. Sorry I couldn't get over it!", "scale": "4.0"}], "negativeReviews": [{"review": "I ventured out and ate here for lunch shortly after opening. When I go out for chicken, I really expect something special- esp for this price. Chicken is good, but not great, and the portions were small. The sides should really be cheaper, because I was not impressed at all with the couple that I tried. Being a local southern girl myself, I can make some pretty mean fried chicken. I really expected more that what I can make at home. I honestly felt a little cheated out of my hard-earned money after going here, and was a little angry that I spent upwards of $15 for lunch (and I drank water) just to sit at a barstool, eat just \"ok\" food in a noisy atmosphere. I don't see this place lasting long in this economy.", "scale": "1.0"}, {"review": "We were all so excited for our first trip to Beasley's! As devoted fried chicken fans, we welcomed this new addition to our downtown dining just as we did The Pit several years ago (for true Southern comfort food). What we got was anything but true Southern and no comfort. The space looks great from the street, but was so loud due to all the hard surfaces we could not hear our dinner companions speak. The drinks were limited and lousy (and expensive), the chicken was dry and soaked in overly sweet honey, and the overpriced sides were tiny portions. Even the biscuits (who can mess up a biscuit) we dry and tasted like raw flour. I have had my first and last trip to Beasley's. Now let's see how bad the celebrity chef can mess up a hamburger!", "scale": "1.0"}, {"review": "Not sure I get the fascination with going out for a meal just for the chance at ordering the most unhealthy options one could muster, but oh well. If I see mac n cheese and fried chicken on a non-country kitchen menu one more time...", "scale": "1.0"}, {"review": "I love chicken and honey. It's always been my special indulgence, so I was very excited to see Beasley's. I won't sugar coat it, it was just terrible. The chicken was really bad. The restaurant itself was cool inside and I really liked the sides, but it's not called Beasley's cool interior and tasty sides. If the name of your business includes Chicken and Honey then both should be good. The chicken was not seasoned properly and very \"juicy\" as if brined in some poorly flavored water. The chicken meat was not good and the breading was not good. Also, the honey had nothing to recommend it. I don't know that I've ever been so disappointed in a meal.", "scale": "1.0"}, {"review": "The most overrated restaurant - ever.", "scale": "1.0"}], "url": "http://www.yelp.com/biz/beasleys-chicken-and-honey-raleigh"}}, "name": "Beasley’s Chicken & Honey", "photo_url": "https://irs2.4sqi.net/img/general/240x240/XmI8GdOQ0r3hnwYUs6LFJJoB924yhNCDg7fgbh0yhq8.jpg"}}, {"g49463-d639062": {"data": {"foursquare": {"count": "103", "rating": "8.5", "reviews": [{"review": "Nice place and the food is good but very small servings. Was still hungry!", "scale": ""}, {"review": "Impressive service", "scale": ""}, {"review": "Had the pork shank and it was to die for. Service was just on point. Food was amazing.", "scale": ""}, {"review": "This place is hit-and-miss for me, but the she-crab soup is always superb. I wish they would improve their lunch service; it takes way too long to do lunch here on a work day.", "scale": ""}, {"review": "Perfect for a special date. The absolute best salmon I've ever had the pleasure of eating. The elderberry cocktail is delightful. The potatoes and spinach were my favorite sides.", "scale": ""}], "negativeReviews": [], "url": "https://foursquare.com/v/18-seaboard/4ade1565f964a520fd7221e3"}, "tripadvisor": {"count": "515", "rating": "4.5", "reviews": [{"review": "quick and tasty sandwiches and salads for downtown workers in an amazing atmosphere -- the Seaboard garden shop invites loitering. Love the railroad atmosphere.", "scale": "5"}, {"review": "18 Seaboard has been a favorite of ours for some time now....since its inception. It has a very convenient location, a very pleasant ambience, really good and inventive food and a very good wine list. The Chef/Owner, Jason, is a very friendly sort whose presence in the dining room greeting customers is always helpful and charming. One of the best...", "scale": "5"}, {"review": "Thank you Jason Smith. 18 Seaboard is always in our top choices for lunch or dinner. Convenient for folks downtown and those elsewhere. Good parking. Southern influenced menu with great local ingredients. Catfish, fried green tomatoes or a salad with some wonderful grilled fish are good choices. Nice atmosphere whether a business lunch or meeting friends.", "scale": "5"}, {"review": "Nice ambience; good food and good wine. I ordered the Cracklin' Pork Shank. It was good, but the flavors were not earth-shattering. Would definitely go back but, the food's flavor profile needs an upgrade.", "scale": "4"}, {"review": "While meeting my goal of trying new restaurants in the area, I tried 18 Seaboard. I had salmon and it was great. I went two girlfriends and they both totally enjoyed their meals as well. I will definitely go back to try more selections.", "scale": "5"}], "negativeReviews": [], "url": "http://www.tripadvisor.com/Restaurant_Review-g49463-d639062-Reviews-18_Seaboard-Raleigh_North_Carolina.html"}, "yelp": {"count": "305", "rating": "4.0", "reviews": [{"review": "My wife and I had the pleasure of visiting 18 Seaboard during the Raleigh food tour. Since we were on the tour we got to meet the executive chef, Serge. We have been on a few food tours in other cities and the chefs are always nice, but it is rare to meet one who has the enthusiasm and desire to take time to talk with his diners as much as Serge.", "scale": "5.0"}, {"review": "Restaurant week was our opportunity to dine here for the first time. Regrettably, it will be our only visit. While the reception, service attention and ambiance were exceptional, unfortunately, the food wasn't. Well, there was one service hiccup, where my glass of wine appeared in timely fashion, but the sangria did not...after asking the waitress, it seemed to have been \"skipped\" by the bartender.", "scale": "3.0"}, {"review": "This has to be one of the first in the Triangle to care about bringing us NC products and telling us what those are. Way ahead of times, really. Truly appreciate this restaurant group for that!", "scale": "4.0"}, {"review": "Really want to do 4 1/2 stars... Took my wife here during triangle Resturant week. Funny thing, everything we wanted was on the regular menu. So we skipped the specials and went for it. I got the pork shank which is their most popular item and my wife a chicken dish. Both were very pleasing. Dessert were these scrumptious chocolate bourbon truffles. YUMM! here was a treat!! I neglected to mention the brisket tacos. Bananas.... The flavor was intense but ever so pleasing. We will be back", "scale": "4.0"}, {"review": "I've been to 18 Seaboard many times and they have not failed deliver a good meal. Our last venture, a pre-holiday dinner, went well. Everyone found something on the extensive menu which looked awesome. Our table ranged from Woodfired grilled salmon to brisket to pork loin to filet mignon. Of course we had a few desserts (Mud Cake) and drinks. For me, the Mandrin Mojito, while it was good, was a bit too dense for my liking. 18 Seaboard continues to be a nice place, for a nicer meal, near the heart of Raleigh's downtown. Cheers.", "scale": "4.0"}], "negativeReviews": [{"review": "A close relative of mine is going through a very tough time with some medical issues and wanted to spend New Years Eve dining with family at 18 Seaboard. However, her medical condition prohibits sitting on chairs which are not heavily padded. After requesting a booth which would give her the opportunity to dine out on this special night, the general manager and owner would not honor this simple request. Had it not been for medical reasons, perhaps I could understand somewhat, but never before have I witnessed such a lack of compassion and understanding on the part of a restaurant with regard to a customer with special needs. I would not patronize this establishment. Maybe it was for the best. We ended up at Four Square in Durham which had no problem accommodating our needs (last minute and a full house) Kudos to Four Square! A big thumbs down for chef, owner Jason at 18 Seaboard who needs to get his head out of the clouds and pay attention to what people are saying before he finds himself on the other end of the spectrum.", "scale": "1.0"}, {"review": "DO NOT GO TO THIS PLACE...", "scale": "1.0"}, {"review": "I've been to 18 seaboard several times for lunch and dinner when I worked down town on Pearson Street and the food and drinks have always been amazing. Me and two friends went for brunch and I was very disappointed. We all ordered the cornmeal waffle with ham mixed in. We added sides and received small portions. The description of the waffle was better than what it taste like. The pecan syrup taste like molasses and was too over powering. We all left with a $30 bill after tip and felt like it was just a donation. Sad to say but the best thing came from the pastry chef who made complementary scones. I will plan the next brunch at my house before wasting money like that again.", "scale": "1.0"}, {"review": "The menu states if you have special dietary needs to let your server know. They should eliminate that statement as they won't. I wanted a filet and could not eat any of their sides due to medical conditions. They could not substitute a green salad or any vegetable besides bpcabbage, radishes or kale. They wouldn't give me a cup of soup minus the two sides. Then the mgr came over and I thought I was in a Dri. Office having to give an explanation. Seems they only have enough food to make each menu item and no exceptions. I didn't want to hear how I should eat what they had. Mind you we ordered a bottle of wine and appetizers. So not restaurant friendly with menu option. Best advice: if you don't like the menu just leave. They won't substitute. Good luck!", "scale": "1.0"}, {"review": "Extremely disappointed. FIRST OFF...if you look at the menu linked from Yelp, don't even think that is their pricing. I went thinking they had $11 catfish plate but in reality it's $18. The catfish was very good, but it was such a tiny piece of fish, smaller than the palm of my hand. And the polenta that came with it was so so and there were two pieces of it! I would have preferred two pieces of catfish and one of polenta. Never even saw the strawberry relish that is supposed to accompany it. The best thing was the spinach. It was awesome. My friend got the Carolina Plantation Sea Island Red Pea Cake and it was truly inedible. Ugh! The atmosphere is nice. It seems like it could be decent but we left spending close to $70 on a very very mediocre meal at best. I have to wonder who is writing these rave reviews...sorry...I just don't see it. There's so much better out there.", "scale": "1.0"}], "url": "http://www.yelp.com/biz/18-seaboard-raleigh"}}, "name": "18 Seaboard", "photo_url": "https://irs1.4sqi.net/img/general/240x240/1492039_7Q6ukskebudVPec1Cx7-uYziF3CrKOm9l-7SdKTVrWQ.jpg"}}, {"g49463-d6278519": {"data": {"foursquare": {"count": "44", "rating": "8.3", "reviews": [{"review": "Amazing food, but no place to park close...", "scale": ""}, {"review": "My fave is the Shrimp Mango Jalfrezi", "scale": ""}, {"review": "Tikka masala", "scale": ""}, {"review": "I really love this place. The food was outstanding! Not too crazy about their cocktails though.", "scale": ""}, {"review": "Vindaloo, any app, kingfisher and naan to wash it down!  Staff is friendly and knowledgeable, very attentive.", "scale": ""}], "negativeReviews": [], "url": "https://foursquare.com/v/kabab-and-curry/52e1bc1d498e61f7931f70ec"}, "tripadvisor": {"count": "35", "rating": "4.5", "reviews": [{"review": "Their food is fabulous. They employees are all Indian and very friendly. Wait time was just right and did i mention the flavors. Keep one thing in mind when ordering. There are different temps you can order your spiciness and I like spicy food and the medium had me sweating.", "scale": "5"}, {"review": "The food at Kabab and Curry was delicious. The Bread Basket appetizers with three sauces was outstanding. I could happily have made a meal of it. In fact, we should probably have ordered a second basket (though there were only five of us), because we all enjoyed it so much. I can't say enough good things about the three sauces...", "scale": "4"}, {"review": "I've been here for both buffet and a la carte ordering for dinner. This is my inside-the-beltline go-to Indian place.\nThe buffet is pretty good. It's not the largest or the smallest I've been to, but it has a decent selection. There are a couple of sauces, pickled onions, salad, papadum, appetizer (usually pakora), plenty of veg and non-veg options,...", "scale": "4"}, {"review": "I hosted a small party in Kabab and Curry on Nov 5th, 2015. It was a very special day as I was married that day and Kabab and Curry allowed me to entertain my family and friends on its premises. The owner Mr Tilo is an exceptional manager and host. He especially make sure to make my experience memorable. All...", "scale": "5"}, {"review": "The food was delicious and the service was very good. Haven't had Nepali and Indian food this good since I was in India and Nepal in the 1980's. The service was really good but not hovering. Goat, lamb and chicken all great, the spice level perfect for those of us who wanted hot, and great for our fellow diner who...", "scale": "5"}], "negativeReviews": [], "url": "http://www.tripadvisor.com/Restaurant_Review-g49463-d6278519-Reviews-Kabab_and_Curry-Raleigh_North_Carolina.html"}, "yelp": {"count": "79", "rating": "4.0", "reviews": [{"review": "I have been to this place twice, both times on a Sunday night. Once coming to Raleigh, I have been looking for an authentic Indian eatery and this hands down is my favorite thus far! The past two times I orders the vegetable Samosa's, Palak Paneer, and Garlic Naan and I have not been let down (I even have enough food left over for 3 more meals for the week)!", "scale": "5.0"}, {"review": "It's the closest Indian/Nepalese restaurant to NC State University and the location is awesome. Parking could be a problem if you go during peak hours. The ambience is good. The lights are little dim but rest of the things are good.", "scale": "3.0"}, {"review": "Food: 4", "scale": "3.0"}, {"review": "INDIAN BUFFET, need I say more!", "scale": "5.0"}, {"review": "Awesome place. The owner/manager is extremely friendly and professional. The food is legit as far as Nepalese food goes. If you ask for it spicy on a scale of 1 to 10 and ask for 8....be prepared for it to be spicy. The atmosphere is nice and the location is convenient to North Campus (NCSU). The waiters are friendly and helpful. I had one of the large plates that is kind of like buffet on a large dish. It was the non-veg and included goat along with various other dishes. It was absolutely delish! These people are Nepalese and know how to cook that's for sure. Don't miss out on this find. Stop in and try their food...They also have a buffet that I am looking forward to trying out.", "scale": "5.0"}], "negativeReviews": [{"review": "My husband and I went there for the lunch buffet. We both love Indian so were excited to try a new place.", "scale": "1.0"}, {"review": "As someone who went to NCSU, I was pretty excited to know that there was a full fledged Indian restaurant on Hillsboroguh. I went here for a late afternoon snack with my friend. We ordered the Kabab & Curry platter and the Dahi Papri. The food was outrageously bland. The platter was a mix of pakoras, samosa's, chicken 65 and couple of kabobs, everything was a let down except for the chicken 65. The dahi papri was plain awful, the dahi was too thin and the papri tasted stale. Service was just average. I am definitely not going back to this place.", "scale": "1.0"}, {"review": "worst food ever in raleigh.", "scale": "1.0"}, {"review": "The food is good but the service sucks. It was twice that we found that the waiter did not add up the check properly and overcharged us. Also, he was reluctant to deduct that amount demanding us to give it off as tip. In another instance, he took 20-25 minutes to get us breads and the reason he gave was that he had forgotten to inform the kitchen. The 2 stars that I've given is only for food quality. But I am never going to that place again. Biryani house in Cary is better.", "scale": "2.0"}, {"review": "The title of this review could be \"room for improvement\". Or it could be \"what a ripoff.\" Or it could be \"only does so well because it's right next to NC State.\"", "scale": "2.0"}], "url": "http://www.yelp.com/biz/kabab-and-curry-raleigh"}}, "name": "Kabab and Curry", "photo_url": "https://irs1.4sqi.net/img/general/240x240/3361890_Seykq8plVWMyzRlPzzFwQrqU59Mr7OkVYR-cidAOzdA.jpg"}}, {"g49463-d2433513": {"data": {"foursquare": {"count": "74", "rating": "8.3", "reviews": [{"review": "Never had a bad experience here. The food, drinks and service are always on point. And they go above and beyond to accommodate my gluten free/dairy free needs.", "scale": ""}, {"review": "We decided to eat here after reading all the great reviews. The staff and service were perfect. The food was good ... But not the best in Raleigh. We will definitely eat here again though.", "scale": ""}, {"review": "Carne tacos, chicken tortilla soup, Mexican flag (but ask for flour tortillas), service is friendly and attentive, good beer and tequila selection", "scale": ""}, {"review": "Mole was amazing and the tamales were almost as good as my grandma's hehe loved the queso dip too. If you like sweet, savory and salty you'll enjoy the plantain dish too!!", "scale": ""}, {"review": "If GF is a must just ask for corn tortillas and GF chips.  Just as good service and food as the one on leadmine just not as much 'character'", "scale": ""}], "negativeReviews": [], "url": "https://foursquare.com/v/gonza-tacos-y-tequila/529a339b11d28010571e1473"}, "tripadvisor": {"count": "329", "rating": "4.5", "reviews": [{"review": "The food here was great! Service was fantastic. All in all this was great and I'll certainly be back. If in the area, you should stop in!", "scale": "5"}, {"review": "gets crowded and often a queue as close to NCSU campus but decent Mexican - best in local (5-10 mins) proximity\nService is great - mainly college kids - food was quick to arrive and decent value\nI could have just eaten the chips and cheese sauce - very good.. but had the Mexican flag tacos and highly recommended.\nNot...", "scale": "4"}, {"review": "Good location near NCSU campus. Tacos were good. Chilaquiles Verdes was missing avocado and chicken in the dish could have fit in a teaspoon", "scale": "3"}, {"review": "My very favorite taco restaurant! The small tacos are served in a variety of ways and all are delicious. The atmosphere is unique and the service has always been wonderful. A must visit if you are visiting Raleigh!", "scale": "5"}, {"review": "I really enjoyed the food here as well as the service - but go early and not weekends to avoid the crowds. I enjoy the carnitas and the fact that they offer a wide range of tequila with sangrita on the side. Great place to go for a casual dinner.", "scale": "4"}], "negativeReviews": [], "url": "http://www.tripadvisor.com/Restaurant_Review-g49463-d2433513-Reviews-Gonza_Tacos_y_Tequila-Raleigh_North_Carolina.html"}, "yelp": {"count": "321", "rating": "4.5", "reviews": [{"review": "ZOMG. I've spend a large portion of my life looking for chicken with mole sauce that didn't make me want to dry heave. I've tried mole at SEVENTEEN other restaurants and it's always been disgusting. A great friend of mine told me that delicious mole exists. Shoot, our waiter (who was AWESOME) promised me that if I didn't love it, it was on him. Seriously? I kept the faith, and I was rewarded. The Mole Gods have smiled upon me at last.", "scale": "5.0"}, {"review": "Overpriced", "scale": "1.0"}, {"review": "I really wanted to love it, I promise.", "scale": "3.0"}, {"review": "Just okay, especially for the price (expensive). The tinga and short rib tacos are good. Just good. Not impressive. The chicken tortilla soup, though...that is definitely out of this world! Might be back, when I'm willing to splurge on 'okay' tacos. I would rather go all the way to Durham, Greensboro (camino real) or Winston-Salem (el rancho tacqueria) for supremely delicious tacos.", "scale": "3.0"}, {"review": "Great food and great ambiance. it is a bit pricey for the size of the tacos, but they are excellent.", "scale": "4.0"}], "negativeReviews": [{"review": "Food was not very good. Refried beans came out with a burnt taste. Rice was so bland, I had to add salt. Salsa was like canned tomatoes. Will never dine there again. Dos Taquitos and Chubby's Taco are much better.", "scale": "1.0"}, {"review": "After searching for many restaurants in the Raleigh area, i stumbled upon this restaurant thinking it was a GREAT find. Considering the high rating, i decided to have my birthday dinner here. We made reservations for 7:30. About 10 members of the party had arrived earlier (around 7:15) the rest of the group (3 of us) showed up at 7:30, leaving 1 person missing. The hostess said they would not seat us until ALL of our group was there. We were patiently waiting outside, the place was PACKED. I wasn't surprised because i had read that they have good food. By this time it was 8:10, we decided to step inside since it was humid and rainy, the hostesses looked at us like we were a huge inconvenience. The manager came up to me (The birthday girl) and said that we needed to wait outside. I asked him \"when are going to be seated?, I am the birthday girl and i am hungry\" (jokingly of course) he answered back \"WELL, who was late?! its not my fault\". I was SHOCKED!!!!!! Then I look over and he proceeded to go carry on a conversation with the FOUR!!!! 4!!! people that he sat at OUR table for a party of 14!!!!!!!!!!! He was plain NASTY and RUDE. I CANNOT stand poor customer service, i had read in prior reviews that Gonza Tacos and Tequila leave people waiting (but then they say that the food was worth the wait) i am sorry, but customer service comes first in my book. That is what keeps people coming back for more. If the manager is rude, imagine the rest of the staff. I will NEVER be going back here.. HORRIBLE HORRIBLE HORRIBLE!!!!!! They need better management. People, if you love the food and keep going back, they will never care to step up their customer service..this is why they keep people waiting and DON'T care to provide good customer service. BTW all 14 of us left, took our services elsewhere, a BETTER UPSCALE restaurant called SITTI in downtown Raleigh who had water waiting for us when we got there!!! You guys need to check them out!! Oh, and as we were leaving the manager of Gonza Tacos and Tequila came out and said \"Hey, where are you going, your table is almost ready\" at this point we all thought it was a JOKE!!!! he had been saying that for almost an hour!!!!!!!!!", "scale": "1.0"}, {"review": "Small portions + high prices = me not going back. Food wasn't that great, either. The killer was the fact the server kept the change without asking me. That decision to keep the change informed me that's all they deserved for a tip.", "scale": "1.0"}, {"review": "Went there at around 5:30 on a weekday recently. The place was about one-third full. We were told there would be about a 40-minute wait.", "scale": "1.0"}, {"review": "My husband and I and my mother in law went here for dinner one night. It was a favorite place of ours and we have patroned here for a while, bought gift certicates as gifts etc. We've told so many people they have to try it. The food is good and the margaritas are usually great. Our server's name was Paul and he was very much a salesman. Very pushy and my mother in law even commented to him that he needs to be in sales. My husband, mother in law and I ordered quite a few margaritas by the end of the night. Not once did we say top shelf. I don't think I've ever ordered a top shelf margarita in my life. There's like a $6 or $7 difference between house and top shelf, I wouldn't spend the money on that. We got our bill and it was larger than we expected but was a little buzzed and paid it anyway. He left a good 20% on top as well.", "scale": "1.0"}], "url": "http://www.yelp.com/biz/gonza-tacos-y-tequila-raleigh"}}, "name": "Gonza Tacos y Tequila", "photo_url": "https://irs2.4sqi.net/img/general/240x240/10679_7hoXBtX_0QuS_YddYGBkjI7iSc9GRKlrMGzbUZr6uws.jpg"}}, {"g49463-d3730863": {"data": {"foursquare": {"count": "153", "rating": "8.0", "reviews": [{"review": "Food was good..server was okay..we ended up having 2 other severs help us more than our actual one..also asked for bacon on my burger and it wasnt on there when i got it.had to be brought out seperate", "scale": ""}, {"review": "Obviously the burgers. Classic southern was great. Sauces were excellent. Salads were fresh. Love the ability to build your own burger and salad too!", "scale": ""}, {"review": "The tater tots with Bad Daddy sauce is a great side item with your burger. Also, $2 Tecate cans on Fridays will start your weekend off on the right foot.", "scale": ""}, {"review": "Ehhh. It was okay. Asked for rare burger with over easy egg. Got a medium burger will well done egg. Rank up there with 5 Guys Burger &amp; Fries", "scale": ""}, {"review": "Western burger (buffalo) is very good. Try the tater tots instead of the fries...just like Napoleon Dynamite eats", "scale": ""}], "negativeReviews": [], "url": "https://foursquare.com/v/bad-daddys/529a59be11d2c01eeb1e870c"}, "tripadvisor": {"count": "254", "rating": "4.5", "reviews": [{"review": "This place makes great burgers with a large portion size! We loved the buffalo burger. The fries were okay but we agreed we would try one of the other sides instead next time. The milkshakes sounded good but seemed overpriced so we didn't get one. We would go back for the burgers for sure and they had a pretty good...", "scale": "4"}, {"review": "My 16-year-old grandson and I arrived here at 11:30 a.m. and found plenty of seating. A half hour later the place was packed. Each of us enjoyed one of their enormous 10-oz. $10 hamburgers, which were perfectly cooked to order (medium well and medium rare), and he got an excellent chocolate shake as well. The service was cheerful, competent, and...", "scale": "4"}, {"review": "The whole family will appreciate this place! Very nice burgers, nice selection of beers and very good service!\nThe 'Sam I am' burger is both innovative and delicious! Avoid rush hours and enjoy!", "scale": "5"}, {"review": "This is one of my favorite burger spots in Raleigh. It is reasonably priced with many options. Has a very casual bar atmosphere for watching the game or grabbing a bite with friends. The servers are some of my favorite in town.", "scale": "5"}, {"review": "Ok, my favorite item was the SAM I AM BURGER!... OMG... It came with a fried egg rosemary ham and fresh pesto...of course cheese too but I love it because it was fresh and I had breakfast with my lunch . lots of fries lots of fries lol..They have so many different items for everyone to enjoy. You can create...", "scale": "5"}], "negativeReviews": [], "url": "http://www.tripadvisor.com/Restaurant_Review-g49463-d3730863-Reviews-Bad_Daddy_s_Burger_Bar-Raleigh_North_Carolina.html"}, "yelp": {"count": "282", "rating": "4.5", "reviews": [{"review": "Great burgers, great beer list, really really great lettuce wrap for the gluten-free crowd.", "scale": "5.0"}, {"review": "The burgers are great. The salads are great. I love the food, but we can only patronize this place during the summer, when we can sit outside. The restaurant is *ridiculously* loud. Immensely loud. Loud beyond what you think is possibly conceivable. The owner keeps the music blasting, and the dining room is all hard surfaces and windows and overhead plumbing/piping. You can't have a conversation without screaming at your companions. You don't calmly order, it's more shouting and gesturing and hoping you've been understood.", "scale": "2.0"}, {"review": "It is very simple.", "scale": "5.0"}, {"review": "Best sweet potato fries, tator-tots, burgers, and salads!! It is absolutely delicious! The atmosphere is great and I have never had a bad waiter/waitress here. Recommend getting the barbecue ranch salad dressing and using the dip that comes with the sweet potato fries!!", "scale": "5.0"}, {"review": "Best burger I've had so far in Raleigh! Always very busy but it's because it's so good! Nice staff too.", "scale": "4.0"}], "negativeReviews": [{"review": "This place was terrible. Will never go back. Very pricey, food was horrendous. Wait staff was friendly and helpful but the food was just terrible.", "scale": "1.0"}, {"review": "We were really disappointed by this place. The service was good, but the food was not. The burgers did not have any seasoning or taste to them - they were the same taste that I could have had anywhere else. And one of our burgers was supposed to be medium, but came out way over-cooked. The fried pickles were basically a pile of grease, and we left feeling a little sick because of it. Not a place I'd recommend for someone looking for a really good burger.", "scale": "1.0"}, {"review": "I love bad daddy's, I've had great experiences at the locations in cary and Charlotte. The food is awesome. I love that they have good quality bison. However the seaboard location service sucks. We sat there for 20 minutes waiting for someone to take our drink order. After several servers walked by us, noticing that we had been there a while and not even attempting to greet us, we walked out. Check out the local joint MO Joe's, down the street on Glenwood south.", "scale": "1.0"}, {"review": "I've been to this restaurant three times. The first time, I was SO EXCITED because they offer a GLUTEN-FREE BUN! Sad they don't toast it so it's more like a dry piece of Styrofoam, but exciting nonetheless. The second time, I got a lettuce wrap, which was actually cool because you could pick it up without it falling apart on you. The fries are spectacular. I could eat bowls.", "scale": "1.0"}, {"review": "Was not impressed... The burgers were are cooked one degree less then you would except, the server does a good job explaining it but it still is a little confusing. The prices are a bit much for what you get. $13 for a basic burger with a few extra toppings is a bit much. I think i will stick with burgerfi for now. although the burgers and prices weren't what i was expecting the service was great. however, I will not being out of my way again.", "scale": "2.0"}], "url": "http://www.yelp.com/biz/bad-daddys-burger-bar-seaboard-raleigh"}}, "name": "Bad Daddy’s Burger Bar - Seaboard", "photo_url": "https://irs3.4sqi.net/img/general/240x240/168615_EZs1lXbeZcEZizQG09QeAIj2KFRXJVrPdhI997Xy9BM.jpg"}}, {"g49463-d444917": {"data": {"foursquare": {"count": "60", "rating": "8.5", "reviews": [{"review": "We loved our shrimp and duck appetizer, duck entree and creme brulee, but everything our friends had looked amazing as Well.", "scale": ""}, {"review": "Great restaurant and great atmosphere great service great food! !!!", "scale": ""}, {"review": "Chef's Table was awesome but not worth the money.", "scale": ""}, {"review": "Everything was great.  The salmon pave, the braised lamb shank and the baked Alaska.  Knowledgeable and friendly staff.", "scale": ""}, {"review": "fried green tomato salad!", "scale": ""}], "negativeReviews": [], "url": "https://foursquare.com/v/second-empire/4aeb2a4cf964a52033bf21e3"}, "tripadvisor": {"count": "297", "rating": "4.5", "reviews": [{"review": "This is without a doubt one of my most favorite restaurants in the US and any time that I am in Raleigh it's a must go to (even more so than Angus Barn).\nThe service is impeccable, I have never been disappointed. The wine list is a lot of fun and a good range to choose from. I prefer the...", "scale": "5"}, {"review": "We had a fabulous dinner. Alex our waiter was great and the food was delicious. The price was fair for the location, the cuisine and the elegance of the restaurant.\nWe are ready to go back!", "scale": "4"}, {"review": "My husband and I have been here for our anniversary a few times. The food has always been wonderful. The duck is cooked perfect and if I were brave enough I might have licked the plate. The bar is a great place to hang out while waiting. Had a divine martini. Definitely a place to check out for your special...", "scale": "5"}, {"review": "We visited here during vacation, for an early anniversary dinner. The atmosphere is nice, bordering on fancy. We arrived about 30 mins ahead of our reservation, and went downstairs to the bar for drinks. It was very relaxed and the bartender was very fast. When we went back upstairs we were immediately seated and given a copy of the menu...", "scale": "5"}, {"review": "was here for a private party food was under whelming, have eaten in bar and had an enjoyable meal. Good cocktails in bar. Very pretty with onsite parking, nice for downtown location", "scale": "3"}], "negativeReviews": [], "url": "http://www.tripadvisor.com/Restaurant_Review-g49463-d444917-Reviews-Second_Empire_Restaurant-Raleigh_North_Carolina.html"}, "yelp": {"count": "270", "rating": "4.5", "reviews": [{"review": "Second Empire blew my expectations out of the water in every single way. Love the upscale feel of this place and by the nature of its building and location, it feels home-y in the best ways possible. Came for a dinner with my family, including my hard to impress parents, and everyone left feeling satisfied and enjoyed the experience.", "scale": "5.0"}, {"review": "Cheyenne our server is simply such a great server. She made our anniversary so much better. She's so friendly, personable yet professional. Love her! Will definitely request for her next time.", "scale": "5.0"}, {"review": "I first heard of second empire when researching what to do for my wife's birthday/Valentine's Day. Her birthday is February 11th and Valentine's Day is the 14th. I knew I wanted to take her somewhere upscale. Upon searching, I saw that second empire seemed like the perfect location for special occasions. They absolutely did not disappoint!", "scale": "5.0"}, {"review": "My husband and I celebrated our anniversary here. I was blown away by the service and food. We made a reservation a few days prior to coming and we couldn't of picked a better place. I found the place to be so charming and romantic. When we were seated we found a special menu wishing us a happy anniversary that was signed by the chef with a sweet message.", "scale": "5.0"}, {"review": "This was our first dining experience at the Chef's Table after several attempts to make reservations, but well worth the wait! If you leave this place hungry or dissatisfied it will be your own fault. Everything is 5 Star, from the food, atmosphere & service. Every time we dine with Second Empire it exceeds all our expectations & leaves us wondering how soon can we book out next dining experience with them. Nothing short of first class all the way around compared to others from around the country. The kitchen hums like a well tuned machine.", "scale": "5.0"}], "negativeReviews": [{"review": "Apparently the chef here does not get the idea of \"beauty of simplicity\", in two ways. First, the presentation. Every course is loaded with sauce, leaves, beans and god knows what, and with all that dim lighting what you see on your plate is a pile of brown mess. I get that they try to present like fine dining but sadly some aesthetic education is urgently needed.", "scale": "1.0"}, {"review": "I had the highest expectations when we retuned last night to the Tavern for dinner. We have been there before and loved the cozy, lovely feel of it, and the excellent food and service we received.", "scale": "1.0"}, {"review": "This restaurant is the epitome of snooty.  Took my wife here and was completely mis treated by a waiter who saw a young couple and decided we weren't worth it. Slammed down food on the table and made for a very memorable date (in a bad way).", "scale": "1.0"}, {"review": "Ah, Second Empire. Now this is a place I've frequented for years, and although I live many thousands of miles away now, I have gone back a few times since moving, most recently about six months ago.", "scale": "2.0"}, {"review": "My boyfriend took me here for a fancy date. We got all dressed up and were excited to check the place out, especially since it's pretty much around the corner from my apartment. Apparently when we made reservations, they asked my man if we were celebrating anything... He said, \"It's wednesday?\" anyways. I was super excited to see pork belly on the menu, so we got that and a cheese plate as starters. For entrees, I had the pork chop and he got the duck breast. We were happy enough with our meals, but couldn't help feeling a little disappointed. There's nothing wrong with Second Empire, but the best part of our meal was sitting on the porch after a bottle of wine and watching the rain.", "scale": "2.0"}], "url": "http://www.yelp.com/biz/second-empire-restaurant-and-tavern-raleigh"}}, "name": "Second Empire Restaurant And Tavern", "photo_url": "https://irs1.4sqi.net/img/general/240x240/21041658_SYDm9dqEGEMDGiy8LgTGG6sIiYxLJxTiXllSKdhc-SQ.jpg"}}, {"g49463-d1061593": {"data": {"foursquare": {"count": "222", "rating": "8.4", "reviews": [{"review": "Still working out some kinks being new, but the food was amazing. Great beer and bourbon list. Outside Brown and Succulent Shoulder were wonderful. Also had the cream corn (delicious).", "scale": ""}, {"review": "Ladereck was super attentive and personable. He offered helpful suggestions as well as a truthful historical background of the restaurant and durham. He turned our opinion around.  Thanks!!", "scale": ""}, {"review": "Some of the best baby back ribs I've had in a while! Also super yummy catfish and a very tasty IPA! On top of that, very good service and super hip ambiance! A must!", "scale": ""}, {"review": "So glad the pit expanded to Durham. Delicious BBQ in an upscale atmosphere! Sit on the rooftop when it's warm for a perfect view of Downtown Durham!", "scale": ""}, {"review": "If you want delicious down home food southern style this is definitely a must.  It has a great atmosphere too which is a plus.", "scale": ""}], "negativeReviews": [], "url": "https://foursquare.com/v/the-pit/5291360e11d20de90e42c30e"}, "tripadvisor": {"count": "1622", "rating": "4.0", "reviews": [{"review": "Great place to take the family for a local meal. The food is an excellent Southern experience. The atmosphere is casual. The service is always great. Just be sure to call ahead because it's no secret that you will consistently get great meal at the Pit.", "scale": "5"}, {"review": "I dined here with a large group of co-workers on a business trip. Our meal was served family style and featured a lot of choices and plenty of food. The flavor is a great representation of Carolina style BBQ and southern cooking married into one restaurant. Great, attentive service for the staff.", "scale": "4"}, {"review": "I was in town to conduct training at our regional office. One of my local counterparts suggested that we'd enjoy visiting \"The Pit\" for BBQ and drinks. It was a great evening with good conversation and excellent food. We chose to go with the family style and were able to sample two appetizers, two sides, three meats and one dessert....", "scale": "5"}, {"review": "I ate here with my water polo team while traveling to a tournament! We're from Texas so it was a real treat to experience some NC barbecue! It was so delicious! 10/10 would do again!", "scale": "5"}, {"review": "Get there early as the lines can get long after 630 and parking can be a serious problem when the crowds swarm the neighborhood. Not worth extreme waiting though. There are other good ones in the immediate vicinity.", "scale": "4"}], "negativeReviews": [], "url": "http://www.tripadvisor.com/Restaurant_Review-g49463-d1061593-Reviews-The_Pit-Raleigh_North_Carolina.html"}, "yelp": {"count": "1586", "rating": "4.0", "reviews": [{"review": "There is no doubt this is a five star BBQ joint! It is one of my go-to places when I am in Raleigh and whenever possible I get the piggy bar. It is like a chef's table but instead of watching pompous primadonnas sous chefs, you get to chew the fat with the guys who smoke, chop, and pull the pork apart and then load the plates. I offer this as the highest complement possible as they have always been very friendly and generous beyond a mess of smoked turkey.", "scale": "5.0"}, {"review": "Disclaimer: I am from New York, so I don't know a whole lot about Carolina BBQ.", "scale": "5.0"}, {"review": "Hands down The Best Fried Chicken I've ever had. Wow! Very juicy and yet crispy.", "scale": "5.0"}, {"review": "I knew my nephew was going to order ribs, and since I wanted to consume as many BBQ meats possible on this trip, I decided to treat myself to the double meat combo with brisket and pulled pork. Overall, the brisket was good, but considering all the accolades regarding The Pit, it did not meet expectations. The ribs faired about the same. A little more time on the smoker was needed as the meat was slightly undercooked. I believe this is what led to the lack of flavor other than the sauce, my nephew, slathered on top of it. As for the pulled pork, it was the better of all three but nothing really notable. The meat was tender and moist, and the taste was pretty good. I initially was not ecstatic with the portion sizes but in hindsight, I really didn't miss anything.", "scale": "4.0"}, {"review": "Best barbecue experience in Raleigh in my opinion. True hardcore barbecue. If you don't mind a little higher fat, leave the baby backs for the Yankees and opt for the Carolina ribs... You'll thank me later!", "scale": "4.0"}], "negativeReviews": [{"review": "If you're in town for a day and want to swing by to grab some ribs to go. Forget it!", "scale": "1.0"}, {"review": "Was contacted by someone at the parent company to discuss the review. Well, when I called the number in the e-mail I never heard back from anyone. I won't discuss the email in detail but it did address the points in my review.", "scale": "1.0"}, {"review": "If I could give this place no stars I would. My friends and I went here for our \"ladies night.\" I was so excited to try this place after reading reviews on Yelp and someone at a church I went to told me about this place, so we were finally able to give it a try. When it came time to order I finally made up my mind to try there meat sampler plate, but what did the waitress tell me, out of the four meats to try they were out of 2 of them (the baby back ribs and the bbq chicken)!!! What in the world?!?!?! I come all the way here to get some good bbq and there out of chicken and baby back ribs? It was only 8:30pm. So I opted to get chopped pork, even though I wanted to cut back on my pork intake. The waitress did not check on us at all and she seemed bothered when we asked her about certain items on the menu. The only thing that was good was the hushpuppies but I will not be back unless they have baby back ribs or bbq chicken.", "scale": "1.0"}, {"review": "I have always seen PIT as the dependable Raleigh eatery that I can take my friends to but of late they have dipped really low in their customer service. I am not the kind of person who is picky but when I call to make a reservation I expect a little civility and not high handedness. No matter how good the food is you cannot get away with this kind of behaviour if you want to retain repeat business.", "scale": "1.0"}, {"review": "Own a nice or fast car? Don't valet.", "scale": "1.0"}], "url": "http://www.yelp.com/biz/the-pit-raleigh"}}, "name": "The Pit", "photo_url": "https://irs0.4sqi.net/img/general/240x240/22639644_GdAkBplnQVVYK4wHwJ2X8rxMErW4htYEZYkhd92wx8g.jpg"}}, {"g49463-d595248": {"data": {"foursquare": {"count": "32", "rating": "8.3", "reviews": [{"review": "The foi gras is excelent and the short ribs is a most!", "scale": ""}, {"review": "Delicioso. Excelent food, excelent service, excelent ambiance.", "scale": ""}, {"review": "The foi feas is excelen, And the short rib superb!!! The service with out iqual!! Totally recomended.", "scale": ""}, {"review": "Great food, great service, great ambiance. Not cheap, but great!", "scale": ""}, {"review": "Save room for dessert. \"Single Chocolate Ball of Dream\". Seriously, save room for dessert.", "scale": ""}], "negativeReviews": [], "url": "https://foursquare.com/v/saint-jacques/4b3122c4f964a520e30025e3"}, "tripadvisor": {"count": "263", "rating": "4.5", "reviews": [{"review": "Many friends told us about the St-Jacques and being French-Canadian I couldn't wait to eat true French food. The food was excellent, the service impeccable, the sommelier's suggestion was perfect and the atmosphere was truly enjoyable. Each course was displayed beautifully, the food was cooked to perfection, the sauces were divine. We truly enjoyed the evening and will go back...", "scale": "5"}, {"review": "Our server was wonderful. She was friendly and on time, and we never had to ask for anything. The speed of the meal itself, kitchen staff wise, was rather slow. I've been to many fine dining establishments, and I do feel as if this was one of the slowest ever. I expected the presentation to be spectacular, but it was...", "scale": "3"}, {"review": "We were invited to dinner by some new friends who were over the moon about St Jacques. We were excited to go, this restaurant had been on our list for quite some time. Our experience wasn't bad, but we found it to not be a very good value for the money. The service was impeccable, great wait staff. The deco...", "scale": "3"}, {"review": "St Jacques is one of a few restaurants we dine at for special occasions. We never have a bad meal. Tonight's meal was not quite up to the restaurant's normally high standards. The service was not as professional as we have come to expect and it was very slow although there were several empty tables. I started with the onion...", "scale": "4"}, {"review": "I am even more impressed with Saint Jacques after my second visit. This last time I went for lunch. The service is impeccable as the staff makes sure that you are always taken care of and go out of their way to make sure you are treated well.\nI ordered the boeuf bourguignon that was on polenta. The flavors were...", "scale": "5"}], "negativeReviews": [], "url": "http://www.tripadvisor.com/Restaurant_Review-g49463-d595248-Reviews-St_Jacques_French_Cuisine-Raleigh_North_Carolina.html"}, "yelp": {"count": "139", "rating": "4.5", "reviews": [{"review": "We were greeted at the door as we arrived minutes ahead of our reservations. We quickly realized that nice jeans and sweaters weren't the norm here, but nobody at the restaurant said a word about. Note for others reading this though: all men were khakis or dress pants, most women were in dresses on the night we went. Be prepared for them to take your coat (I left my cell phone in my pocket and didn't get as many pictures of the food as I'd like).", "scale": "5.0"}, {"review": "Oh Saint Jacques....overall I'm a fan. I'll cut to the chase though: there's no excuse for room temperature, if not colder, main courses. It's the reason I can't give this place 5 stars: it loses a star for cold food. But I loved so much about it, hence 4 stars!", "scale": "4.0"}, {"review": "We came to St. Jacques on my parent's final trip up the East Coast as they retire to France. They had been here many times and had regaled me with how wonderful this place was.", "scale": "5.0"}, {"review": "My favorite upscale dining restaurant in Raleigh! We dined here to celebrate our engagement and got a lot of food for $150. Instead of getting two large entrees, we mixed things up and got a smattering of apps, drinks and desserts. We enjoyed the mussels (huge portion and delish sauce) and french onion (super rich) soup most, and the chocolate study dessert was really different, with varying textures and flavors of chocolate that I would definitely get again. Service was classy throughout. Come hungry and be prepared for a slow, traditional and delicious time!", "scale": "5.0"}, {"review": "Finally got to eat at this little gem. The service was wonderful. A cute Brit guy greeted us and we were taken to a table. The ambience was lovely, low lighting and the place wasn't horribly crowded for a Saturday night. My BFF Mel and I had pate de campaign to start and it was perfect and came with small slices of toast and some greens. Then came some mussels which were perfectly done and swimming in a cream sauce. Then the star of the show the Coquille St. Jacques was so divine it was like kissing Armie Hammer In a creamy mornay sauce! Of course we had to have the chocolate bomb or ball, I don't recall the name but I do recall the elation! I wanted to have sex with after I devoured it. It was porn-i-fique. The place is perfect for a romantic dinner and reminded me of being in France, not Paris, but lets say Marseilles. Come to SJ and leave feeling nude, b/c the food will make you want to strip on the Seine and kiss a stranger!", "scale": "5.0"}], "negativeReviews": [{"review": "We were greeted at the door as we arrived minutes ahead of our reservations. We quickly realized that nice jeans and sweaters weren't the norm here, but nobody at the restaurant said a word about. Note for others reading this though: all men were khakis or dress pants, most women were in dresses on the night we went. Be prepared for them to take your coat (I left my cell phone in my pocket and didn't get as many pictures of the food as I'd like).", "scale": "5.0"}, {"review": "Oh Saint Jacques....overall I'm a fan. I'll cut to the chase though: there's no excuse for room temperature, if not colder, main courses. It's the reason I can't give this place 5 stars: it loses a star for cold food. But I loved so much about it, hence 4 stars!", "scale": "4.0"}, {"review": "We came to St. Jacques on my parent's final trip up the East Coast as they retire to France. They had been here many times and had regaled me with how wonderful this place was.", "scale": "5.0"}, {"review": "My favorite upscale dining restaurant in Raleigh! We dined here to celebrate our engagement and got a lot of food for $150. Instead of getting two large entrees, we mixed things up and got a smattering of apps, drinks and desserts. We enjoyed the mussels (huge portion and delish sauce) and french onion (super rich) soup most, and the chocolate study dessert was really different, with varying textures and flavors of chocolate that I would definitely get again. Service was classy throughout. Come hungry and be prepared for a slow, traditional and delicious time!", "scale": "5.0"}, {"review": "Finally got to eat at this little gem. The service was wonderful. A cute Brit guy greeted us and we were taken to a table. The ambience was lovely, low lighting and the place wasn't horribly crowded for a Saturday night. My BFF Mel and I had pate de campaign to start and it was perfect and came with small slices of toast and some greens. Then came some mussels which were perfectly done and swimming in a cream sauce. Then the star of the show the Coquille St. Jacques was so divine it was like kissing Armie Hammer In a creamy mornay sauce! Of course we had to have the chocolate bomb or ball, I don't recall the name but I do recall the elation! I wanted to have sex with after I devoured it. It was porn-i-fique. The place is perfect for a romantic dinner and reminded me of being in France, not Paris, but lets say Marseilles. Come to SJ and leave feeling nude, b/c the food will make you want to strip on the Seine and kiss a stranger!", "scale": "5.0"}], "url": "http://www.yelp.com/biz/saint-jacques-raleigh?osq=St+Jacques+French+Cuisine"}}, "name": "Saint Jacques", "photo_url": "https://irs2.4sqi.net/img/general/240x240/2126188_MMwG5Uxxy-InmG1EW_X5YV_Dfj7yK18YTv4kkPV-y90.jpg"}}]}